{"url": "https://eui.edu.eg/", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/ar/node/1", "chunk_index": 0, "text": "Skip to main content الصفحة الرئيسية الصورة خطوط الباصات متاحة الان! للعام الأكاديمي 2026-2025 للمزيد الصورة مصروفات العام الأكاديمي 2026-2025 متاحة الان اضغط هنا الصورة قدم الان للفصل الدراسي Fall 2025 سجل الآن الصورة تصنيف تايمز للتعليم العالى التفاصيل الصورة شهادة مزدوجة تمنحك الأفضلية في سوق العمل! سجل الآن الصورة حرم جامعي مجهز علي أعلي مستوي سجل الآن الصورة حرم جامعي ينبض بالحياة! سجل الآن الصورة خريجون منافسون.. يصنعون الفارق في سوق العمل! سجل الآن prev next الكليات كلية الهندسة كلية الهندسة البرامج: هندسة الالكترونيات والاتصالات هندسة الحاسب هندسة الميكاترونكس الهندسة الصناعية ( يتم فتحه قريبا) المزيد عن الكلية كلية علوم الحاسب والمعلومات كلية علوم الحاسب والمعلومات المسارات الأكاديمية: الامن السيبراني الذكاء الاصطناعي علوم الحاسب علوم وهندسة البيانات هندسة البرمجيات ( يتم فتحه قريبا) الرسم بالحاسب وبرمجة الألعاب الالكترونية ( يتم فتحه قريبا) المزيد عن الكلية كلية تكنولوجيا الأعمال كلية تكنولوجيا الأعمال البرامج الأكادبمية: تحليل الأعمال ادارة تكنولوجيا الأعمال التسويق الرقمى والتجارة الالكترونية التمويل المحاسبة ( يتم فتحه قريبا) ريادة الأعمال والابتكار ( يتم فتحه قريبا) المزيد عن الكلية كلية الفنون الرقمية والتصميم كلية الفنون الرقمية والتصميم البرامج الأكاديمية: تصميم الألعاب تصميم تجربة المستخدم التصميم الرقمي الداخلى فنون الرسوم المتحركة تصميم الجرافيك والوسائط ( يتم فتحه قريبا) فنون التصميم التفاعلى ( يتم فتحه قريبا) فنون الوسائط الحديثة ( يتم فتحه قريبا) المزيد عن الكلية الصورة نقاط تميز الجامعة Image حياة طلابية متكاملة تتنوع الأندية الطلابية والفعاليات والأنشطة وبرامج العمل والدراسة لإثراء تجربة الطلاب وتعزيز حيوية الحرم الجامعي. Image التدريب العملي والصناعي توفر الجامعة تدريبًا صناعيًا وتدريبًا عمليًا على مدار العام لضمان حصول الطلاب على خبرة عملية تُهيئهم بشكل ممتاز لسوق العمل بعد التخرج. Image منح دراسية متنوعة تقدم الجامعة منح دراسية كاملة وجزئية للطلاب المتميزين، مما يجعل التعليم الذي تقدمه EUI في متناول طيف أوسع من الطلاب، تشجيعًا للتميز الأكاديمي والتنوع. Image شهادات مزدوجة ذكية يمكن للطلاب المؤهلين الحصول على درجات دولية مرموقة من أبرز الجامعات الشريكة بعد الدراسة في EUI، مما يعزز مكانة البرامج ويعطي ميزة تنافسية للخريجين. Image الدعم الكامل من وزارة الاتصالات وتكنولوجيا المعلومات توفر EUI معامل متطورة، وتعاونًا مع رواد الصناعة، وتدريبًا على التحول الرقمي، وعلاقات قوية مع مؤسسات وزارة الاتصالات وتكنولوجيا المعلومات المتواجدة داخل مدينة المعرفة. Image الموقع والنظام البيئي يتميز موقع EUI في مدينة المعرفة، بالقرب من مؤسسات وزارة الاتصالات وتكنولوجيا المعلومات، بتوفير موارد غنية، وشبكات تواصل، وواحة تكنولوجية، وروابط صناعية للطلاب. Image شراكات مع كبرى شركات  الاتصالات وتكنولوجيا المعلومات تتعاون EUI مع كبرى الشركات مثل مايكروسوفت، وIBM، وAWS، وتيراداتا، وDELL، وغيرها. الفعاليات Sorry, we couldn't find any results. اخر الأخبار Listing News 14  August  2025 جامعة مصر للمعلوماتية تستضيف المرحلة النهائية من أولمبياد مصر للعلوم الحاسوبية 2025 9  August  2025 يوم الابتكار  في قلب جامعة مصر للمعلوماتية: Main Segment 2025 4  August  2025 فريق FinBud بجامعة مصر للمعلوماتية ضمن أفضل 10 فرق في مسابقة CBE FinTech Got Talent 4  August  2025 فوز ثلاثة طالبات من كلية الفنون الرقمية بالتصميم بجائزة وميض للأفلام القصيرة 2  August  2025 وزارة الاتصالات تُطلق مسابقة Digitopia لدعم الإبداع واكتشاف الشباب الموهوبين 31  July  2025 ختام فعاليات قافلة الذكاء الاصطناعي ( AI Caravan) الانجازات في أرقام Image 16 + أندية طلابية أكاديمية، ثقافية واجتماعية Image 4 كليات تقدم برامج في الاتصالات وتكنولوجيا المعلومات Image 100 + فرص تدريب مع الصناعة Image 100 + منح كاملة لأوائل الثانوية العامة شركاء النجاح prev next الصورة الصورة اليوم، أتخرج في علوم الكمبيوتر من الجانب الآخر من العالم، من جامعة مينيسوتا توين سيتيز. إذا كان هذا لا يثبت أنك قادر على تحقيق ما هو أبعد مما تتخيل، فما الذي سيثبته؟ الخطوات الأكثر إثارة للخوف تبني الأجنحة الأقوى. محمود بربري حاصل على درجة مزدوجة من جامعة مينيسوتا توين سيتيز الصورة أنا معجب حقًا بالتقدم والإنجازات التي حققتها الجامعة على مر السنين. كوالد لزينة، التي كانت من أوائل الطلاب الذين التحقوا بجامعة مصر للمعلوماتية، أشعر بفخر كبير لرؤية مدى تطور الجامعة. لقد كان نموها وتقدمها على جميع المستويات مصدر إلهام عميق لي. الأستاذ الدكتور خالد كامل والد الطالبة زينة بكلية تكنولوجيا الأعمال الصورة خلال زيارتي لجامعة  للمعلوماتية، أعجبت كثيرًا بكيفية مواكبة الجامعة لأرقى المؤسسات التعليمية في العالم. ليتوانيا تتطلع إلى استكشاف فرص التعاون مع الجامعات المتخصصة في مجال الاتصالات وتكنولوجيا المعلومات، مع التركيز بشكل خاص على الأمن السيبراني. أثني على جامعة مصر للمعلوماتية لبرامجها الأكاديمية المتميزة، وأتطلع إلى إقامة شراكات مثمرة مع الجامعات الليتوانية في المجالات العلمية والأكاديمية والبحثية لتعزيز قطاع الاتصالات وتكنولوجيا المعلومات في البلدين. سعادة السفير أرتوراس جاليوناس سفير ليتوانيا لدى مصر الشركاء الاستراتيجين والرعاة الشركاء الاستراتيجين الراعى الماسى الراعي البلاتيني الراعى الذهبى الراعي الفضى", "length": 722}
{"url": "https://eui.edu.eg/who-we-are", "chunk_index": 0, "text": "Skip to main content Who we are One of the first specialized universities in Communications and Information Technology Overview At the heart of Knowledge City in the New Administrative Capital, the Ministry of Communications and Information Technology, in collaboration with the Ministry of Higher Education and Scientific Research, established Egypt University of Informatics (EUI) with the goal of becoming a leading institution specialized in the fields of Communications and Information Technology (ICT) and related areas across the Middle East and Africa. Egypt University of Informatics is a non-profit university aiming to build a specialized community in information and communications technology, empowering youth to acquire the digital skills necessary to meet the demands of local, regional, and international labor markets. This university is a key part of the Ministry of Communications’ initiatives to build an integrated information society and to enhance the growth of the IT sector within the New Administrative Capital. Recognizing the university’s potential to graduate outstanding professionals in this field, the former President, Counselor Adly Mansour, graciously accepted the position of Chair of the University Board of Trustees, which includes a distinguished group of prominent figures from academia, the IT and media sectors, and the public sphere. The university comprises four faculties: the Faculty of Computer and Information Sciences, the Faculty of Engineering, the Faculty of Informatics Management Sciences, and the Faculty of Arts and Digital Design. It offers multidisciplinary technological programs aimed at keeping pace with modern technologies, business requirements, and practical applications. The university has attracted a distinguished faculty with extensive international experience in teaching and scientific research in specialized fields. The administrative framework follows the highest standards, while the academic curricula in areas such as digital transformation, artificial intelligence, data engineering, and other modern specialties have been carefully designed by Egyptian and international experts. These curricula are prepared to align with global standards, comply with local quality and accreditation requirements, and are delivered through dual-degree agreements with leading universities worldwide. Graduates who meet the requirements of the partner universities receive dual certificates from Egypt University of Informatics and the foreign institution. Under these agreements, admitted students spend their final academic year at one of the partner universities abroad, while the courses during the earlier years are offered in a blended learning system at EUI. Notable partnerships include agreements in electrical and computer engineering with Purdue University in West Lafayette (ranked #6 in engineering according to the US News 2024 ranking), and with the University of Minnesota – Twin Cities (ranked #36 in computer science according to the same ranking), as well as the Telfer School of Management in fields such as finance, business technology management, and marketing, which is ranked among the top 1% of business schools worldwide with triple accreditation: AACSB, AMBA, and EQUIS, and the University of Ottawa (ranked #10 among the best Canadian universities in the US News 2024 ranking). Image EUI’s Vision and Mission Vision Image Our vision is to influence the future of technology by empowering graduates to take on leadership roles through world-class education, advanced scientific research, transformative innovation, strategic collaboration with industry, and driving effective and purposeful societal impact. Mission Image Our mission is to prepare generations of outstanding graduates capable of excelling in the rapidly evolving landscape of information and communication technology. In our student-centered education, we place special emphasis on practical innovation, advanced scientific research, and strategic partnerships, including close collaboration with the industrial sector, to ensure sustainable development and service to society. Image Our Values Egypt University of Informatics (EUI) is committed to four core values: Creativity and Excellence , Respect and Integrity , Openness and Participation , and Governance and Transparency . Creativity and Excellence Promoting innovation and high standards, resulting in the graduation of highly competent students and impactful scientific research. Respect and Integrity Prioritizing honesty, fairness, and academic ethics within the university community. Openness and Participation Emphasizing community service, industry collaboration, and environmental stewardship. Governorance & Transparency Ensuring effective decision-making and efficient service delivery, thereby enhancing operational efficiency and academic excellence. Message from the Founding President Dear EUI Community, I feel a deep pride toward Egypt University of Informatics (EUI), which began its activities in the 2021–2022 academic year and is located within Knowledge City. As a pioneering institution in the fields of Communications and Information Technology, Egypt University of Informatics represents the outcome of a strategic collaboration between the Ministry of Communications and Information Technology and the Ministry of Higher Education. Our steadfast commitment is to provide world-class education and prepare graduates capable of assuming leadership roles in a rapidly changing job market. We focus on a balanced approach that integrates theoretical knowledge and practical skills, which includes continuous infrastructure development, applied industrial training, and strong partnerships with industry leaders—all of which constitute the foundational pillars of our mission. More about Prof. Reem", "length": 802}
{"url": "https://eui.edu.eg/board-trustees", "chunk_index": 0, "text": "Skip to main content Board of Trustees Image Board of Trustees His Eminence Counsellor Adly Mansour Chairman of the Board of Trustees Counselor Adly Mahmoud Mansour, having previously served as both the President of the Supreme Constitutional Court and the President of the Arab Republic of Egypt, was honored with the prestigious Great Collar of the Nile in recognition of his significant contributions to navigating the transitional phase of Egypt's modern history. Image Eng. Raafat Abdel Aziz Fahmy Hindy Vice Chairman of the Board of Trustees Engineer Hindy serves as Deputy Minister of Communications and Information Technology for Infrastructure, leading the Communications and Infrastructure Sector. With 30+ years of experience, he's overseen various global telecom and infrastructure projects. Notably, he founded the communications and infrastructure sector in 2006 and executed 100+ projects, including smart village infrastructure and the Egyptian university network. Image His Excellency Prof. Dr. Sherif Sedky Member Prof. Dr. Sherif Sedky has over 31 years of experience at institutions like UC Berkeley and Stanford. He has published over 100 articles, holds 19 patents, and served as the Founding Provost of Zewail City, creating a world-class university. In August 2022, he became the CEO of the Egyptian Space Agency. Dr. Sedky has received multiple prestigious awards, including the Abdul Hameed Shoman Prize. Image His Excellency Prof. Sherif Hammad Member Professor Hammad, a former Minister of Scientific Research, is the founder and Chief technology officer of Garraio, LLC, a service provider for automotive embedded systems, since 2015. He also serves as a computer engineering professor at Ain Shams University. Previously, he held roles as Vice Dean for Education and Student Affairs, and as Dean of the Faculty of Engineering for three years. Image His Excellency Prof. Motaz Khorshid Member Professor Khorshid, who previously served as the Minister of Higher Education and Scientific Research in Egypt in 2011, held leadership roles as Vice President at Cairo University and subsequently at the British University in Egypt. Presently, he holds the position of Professor of Decision Support at the Faculty of Computing and Artificial Intelligence at Cairo University. Image Excellency Ambassador Ehab Badawi Member In October 2020, Ambassador Badawi became Assistant Minister of Foreign Affairs after serving as Egypt's ambassador to France since September 2014. Before this, he was the Official Spokesman for the Presidency of the Republic and led the Cairo Regional Training Center for Conflict Resolution and Peacekeeping in Africa. He is Egypt’s ambassador to Spain from April/May 2024. Image Mr. Hesham Okasha Member Mr. Hisham Okasha was appointed Chief Executive Officer of Banque Misr in September 2024, bringing over 30 years of banking experience. He joined the National Bank of Egypt in April 2008 as Deputy Chairman, playing a key role in restructuring the bank during the Central Bank of Egypt’s reform program, and served as Chairman from August 2013 to September 2024. Mr. Okasha holds a Bachelor’s degree in Economics and Computer Science and a Master of Public Administration (MPA) from the American University in Cairo. Image Prof. Reem Bahgat Member - EUI's Founding President Professor Reem Bahgat, president and co-founder of Egypt University of Informatics. She earned her MSc and Ph.D. from Imperial College London. Throughout her career, she held key roles, including Dean of Faculty of Computers and Artificial Intelligence at Cairo University, and Assistant to the University President for Information Technology Affairs. She also served as Cultural and Educational Counselor at the Egyptian Embassy in the UK. Image Prof. Ahmed Khattab Member Prof. Ahmed Khattab is the Director of the National Telecommunication Institute in Cairo, Egypt, since May 2023. He has over 12 years of experience at The American University in Cairo, where he has progressed from Adjunct Assistant Professor to Professor. Previously, he was a Professor at Cairo University and Director of the High Technology Center. Prof. Khattab holds a Ph.D. in Computer Engineering from the University of Louisiana at Lafayette and has focused his research on spectrum sensing and communication systems. Image Dr. Heba Saleh Member Dr. Heba Saleh has been the Chairwoman of the Information Technology Institute (ITI) since 2011, driving key initiatives in technology education in Egypt. She is a Board Member at Exceed Company and directed the EduEgypt Initiative, benefiting 45,000 students with a 70% job placement rate. Dr. Saleh holds a Ph.D. from the University of Sunderland and has extensive experience in project management. Her contributions significantly impact the field of information technology. Image Prof. Said Megahed Member Professor Megahed is a leading scientist in Cairo University's Faculty of Engineering, specializing in Robotics, Dynamics, and Control, with over 100 published papers. He received his Ph.D. in Automation and Robotics from Paul Sabatier University, France. Prof. Megahed held significant leadership positions, including Vice President for Research and Acting President at the Egypt-Japan University of Science and Technology. Image Prof. Khaled Ismail Member Prof. Khaled Ismail, founder and chairman of KI Angel, holds key roles in investment, including at Feather Invest and Leap Ventures Investment Committee. He advises the Egyptian American Foundation Fund and serves on the board of El Sewedy Electric Company. Prof. Ismail has also served on the Presidential Advisory Council for Economic Development. Renowned for founding SySDSoft, acquired by Intel in 2011, he held the position of managing director of Intel Mobile Communications from 2011 to 2014. Image Dr. Mohamed Hammady Member Dr. Hammadi served as the Chief Technology Officer of Sky Group. He spearheaded the development of a comprehensive technology strategy across European Sky territories, overseeing critical areas such as Sky TV services, broadband, mobile, and cybersecurity initiatives. Additionally, as a non-executive director of the U.K.'s Standards Authority for Networks and Services Interoperability (NICC), he advocates for industry standards. Image Dr. Almoataz Bellah Ahmed Taha Director of Technical Secretariat of the Board of Trustees Dr. Al-Moataz Bellah Taha oversees strategic projects as Chief of the Minister's Office at the Ministry of Communications and Information Technology (MCIT) and directs the Technical Office at ITIDA. With vast experience, he held key roles at ITIDA, the Egyptian Cabinet, RITSEC, and GARPAD. Dr. Taha also serves on the boards of Egypt Post and Silicon Waha, guiding strategic directions. Image", "length": 1017}
{"url": "https://eui.edu.eg/top-management", "chunk_index": 0, "text": "Skip to main content Top Management Top Management Prof. Reem Bahgat EUI’s Founding President Prof. Ahmed Mohamed Hamad EUI’s Acting President Prof. Ashraf Mahran Dean Faculty of Engineering Prof. Hoda Mokhtar Dean, Faculty of Computing and Information Sciences Faculty of Computing and Information Sciences Prof. Ashraf Zaki Dean, Faculty of Digital Arts and Design Faculty of Digital Arts and Design Prof. Mohamed Saleh Dean, Faculty of Business Informatics Faculty of Business Informatics", "length": 72}
{"url": "https://eui.edu.eg/eui-founders", "chunk_index": 0, "text": "Skip to main content EUI Founders Image EUI Founders Prof. Reem Bahgat EUI’s Founding President Prof. Mohamed El-Sharkawi Professor of Data Science and Engineering Faculty of Computing and Information Sciences Dr. Amal Elgammal Head of Software Engineering Dept Faculty of Computing and Information Sciences Dr. Amany H.B. Eissa Head of EUI's Entrepreurship and Innovation Center Faculty of Computing and Information Sciences", "length": 61}
{"url": "https://eui.edu.eg/eui-agreements", "chunk_index": 0, "text": "Skip to main content EUI Agreements Purdue West Lafayette Dual bachelor’s degree in Electrical and Computer Engineering with the School of Electrical and Computer Engineering at Purdue West Lafayette University (ranked # 6 in Best Engineering Schools, US. News, 2024) Professional master’s degree in Information Security with Purdue West Lafayette University (ranked # 6 in Cyber Security in US. News, 2024) Read more Official Press Release University of Minnesota Twin Cities Dual bachelor’s degree with the Department of Computer Science & Engineering , College of Science & Engineering at the University of Minnesota Twin Cities (ranked # 36 in Computer Science in US. News, 2024) Read more Professional master’s degree in Information Security with Purdue West Lafayette University (ranked # 6 in Cyber Security in US. News, 2024) University of Ottawa Dual bachelor’s degree in Finance, Business Technology Management, and Marketing with Telfer School of Management (ranked within the top 1% of business schools in the world with the triple crown accreditation: AACSB, AMBA, and EQUIS), the University of Ottawa (ranked #9 in Best Global Universities in Canada, US.News, 2024) Read more", "length": 182}
{"url": "https://eui.edu.eg/times-higher-education-rankings", "chunk_index": 0, "text": "Skip to main content Times Higher Education Rankings Times Higher Education Rankings Ranking for 2025 Egypt University of Informatics (EUI) has maintained its position in the Times Higher Education (THE) Impact Rankings 2025, securing a spot in the 1501+ category despite increased global competition, with participating universities rising from 1,963 in 2024 to 2,318 this year. Sustainable Development Goals: Impact Ranking: 1501+ Good Health and Well-being (ranked 1501+) Quality Education (ranked 1501+) Gender Equality : (801-1000th) Decent Work and Economic Growth (1001+) Partnerships for the Goals (ranked 1501+) Check more Image Ranking for 2024 Egypt University of Informatics (EUI) has been ranked among the top universities in the Times Higher Education Impact Rankings for 2024, having been evaluated just two years after commencing its educational programs. This ranking includes 2,152 universities and educational institutions from 125 countries and regions. Sustainable Development Goals: Decent Work and Economic Growth (ranked 601-800) Gender Equality (ranked 601-800) Reducing Inequality (ranked 801-1000) Good Health and Well-being (ranked 1001+) Quality Education (ranked 1501+) Partnerships for the Goals (ranked 1501+) Check more Image", "length": 176}
{"url": "https://eui.edu.eg/entry-requirements", "chunk_index": 0, "text": "Skip to main content Entry Requirements At EUI, we guarantee the best high-quality education. Thanaweya Amma & Foreign Certificates Thanaweya Amma Faculty of Engineering Only holders of Maths section are eligible to apply Faculty of Computing & Information Sciences Holders of Maths and Science sections only are eligible to apply Faculty of Digital Arts & Design Holders of all sections are eligible to apply ( Maths, Science & Literature) Faculty of Business Informatics Holders of all sections are eligible to apply ( Maths, Science & Literature) Arab Thanaweya Faculty of Engineering Only holders of Maths section are eligible to apply Faculty of Computing & Information Sciences Holders of Maths and Science sections only are eligible to apply Faculty of Digital Arts & Design Holders of all sections are eligible to apply ( Maths, Science & Literature) Faculty of Business Informatics Holders of all sections are eligible to apply ( Maths, Science & Literature) Nile Certificate Faculty of Engineering English, Arabic, Math, Chemistry, Physics (All L1) + Math L3 or (Math + Chemistry or Physics or Biology) (L2) + 2 electives (L1) Faculty of Computing & Information Sciences English, Arabic, Math, Chemistry, Physics (All L1) + Math L3 or (Math + Chemistry or Physics or Biology) (L2) + 2 electives (L1) Faculty of Business Informatics English, Arabic, Math (All L1) + 4 electives (L1) Faculty of Digital Arts & Design English, Arabic, Math (All L1) + 4 electives (L1) Academic Credentials: 7 (L1) subjects are required for the faculties Business Informatics and Digital Arts & Design. For the faculties Engineering and Computing & Information Sciences: 7 (L1) + Math (L3) or Math (L2) + Chemistry or Physics or Biology (L2) are required. Minimum accepted Grade is \"E\". American Diploma Faculty of Engineering English Language or Literature, Math, Advanced Math (or Math of EST II or equivalent ACT II), Physics, Chemistry + 4 electives Faculty of Computing & Information Sciences English Language or Literature, Math, Advanced Math (or Math of EST II or equivalent ACT II), Physics, Chemistry + 4 electives Faculty of Business Informatics English Language or Literature Other optional subjects must include any subjects 5 of the following: Geography, Global Studies, Social Studies, History, Economics, Business Studies, Mathematical Subject, Principles of Statistics, Accounting, Physics, Chemistry, Biology, German or French (one European language), Computer Science, + 2 electives. Faculty of Digital Arts & Design English Language or Literature Other optional subjects must include 5 subjects of the following: Geography, Global Studies, Social Studies, History, Economics, Mathematical subject, Principles of Statistics, Accounting, French or Spanish or Italian, Philosophy or Logic, Biology, Physics, Chemistry, Sociology, Art, Computer Science, or Information Technology, + 2 electives. Academic Credentials: Having successfully completed (8) different subjects. Subjects less than one credit are not accepted. Subjects can be calculated from Grade 12, 11 or 10. The minimum number of subjects to be calculated from G12 is 4, maximum number of subjects from G11 is 4, and to be completed accordingly from G10 if needed however the maximum number of subjects to be calculated from G10 is 2. Subjects as PE, music, yearbook, religion… are not counted. EST I (or equivalent ACT I) minimum accepted score is 800/1600 ONLY as a passing grade. EST II (or equivalent ACT II) is highly recommended & gives extra bonus for student’s overall evaluation & tuition category (minimum accepted score is 900/1600). EST II will be mandatory only in case the student wishes to join the Engineering and Computer Science Group and didn’t take Advanced Math in school Transcript in grades 10, 11 or 12. Subjects to be accepted in EST II (or equivalent ACT II): For Engineering & Computing and Information Sciences: Math is a necessity + Physics or Chemistry or Biology. IGCSE Faculty of Engineering English Language or Literature (OL), Math (OL), Math (AL or ASL), Physics (OL), Chemistry (OL), + 4 electives. Faculty of Computing & Information Sciences English Language or Literature (OL), Math (OL), Math (AL or ASL), Physics (OL), Chemistry (OL), + 4 electives. Faculty of Business Informatics English Language or Literature Other optional subjects must include any subjects 5 of the following: Geography, Global Studies, Social Studies, History, Economics, Business Studies, Principles of Statistics, Accounting, Math, Physics, Chemistry, Biology, German or French, Computer Science / Information & Communication Technology, + 2 electives. Faculty of Digital Arts & Design English Language or Literature Other optional subjects must include 5 of the following: Geography, Global Studies, Social Studies, History, Economics, Mathematics, Principles of Statistics, Accounting, French or German (one Foreign European Language only), Philosophy or Logic, Biology, Physics, Chemistry, Sociology, Art, Computer Science/Information & Communication Technology, + 2 electives. Academic Credentials: 8 (OL) subjects are required for the faculties Business Informatics and Digital Arts& Design. For the faculties Engineering and Computing & Information Sciences: 8 (OL) + Math (AL/ASL) are required. Minimum (OL) Grade is \"C\". Minimum (AL or ASL) Grade is \"D\". Maximum number of (AL or ASL) subjects to be calculated is: 2(ALs) or 4(ASLs) or 1(AL+2ASL) subjects. Accepted scores must be taken during not more than 4 consecutive years. International Baccalaureate Faculty of Engineering English Language and/or Literature Math (HL) Physics (HL) Faculty of Computing & Information Sciences English Language and/or Literature Math (HL) Physics (HL) Faculty of Business Informatics English Language and/or Literature Other subjects must include 5 of the following: - Arabic /Geography/ History/ Economics/ Business Management/ Math / Physics/ Chemistry/ Biology/ German/ French/Computer Science… A strong background in Mathematics is highly recommended. Faculty of Digital Arts & Design English Language and/or Literature Other optional subjects must include 5 subjects of the following: - Arabic /Geography/ History/ Economics/ Business Management/ Math / Physics/ Chemistry/ Biology/ German/ French/Computer Science/ visual Art… Academic Credentials: Passing 6 subjects with a minimum of 3 taken in the High Level (including the qualifying subjects). A total score of minimum of 24/45 is required. Passing the English Language is a must for acceptance. Theory of knowledge, Extended Essay & Creativity are required. Students must obtain the final graduation IB Diploma.", "length": 1000}
{"url": "https://eui.edu.eg/required-documents", "chunk_index": 0, "text": "Skip to main content Required documents for different certificates Thanaweya Amma & Foreign Certificates Thanaweya Amma Image Original Thanaweyya Amma Certificate or Certified original (مستخرج رسمى) Original Birth certificate 6 passport-size photos Military Service Form (Namouzag 2 Gond) for Egyptian male students only. Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. Arab Thanaweya Image The original Arab Thanaweya Certificate stamped by the Ministry of Education + stamp of the Ministry of Foreign Affairs of the country of the certificate and stamp of the Egyptian Embassy in the country of the certificate are required. Aptitude  Certificate (Saudi Thanaweya Certificate only) Proof of 12 years of schooling (Yemeni certificate only) Original Birth certificate 6 passport-size photos Military Service Form (Namouzag 2 Gond) for Egyptian male students only. Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. STEM Image Original STEM Certificate. Original Birth certificate 6 passport-size photos Military Service Form (Namouzag 2 Gond) for Egyptian male students only. Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. American Diploma Image Original final high school transcript obtained from Egypt, stamped by the school, + stamp of the U.S. Accreditation Institution + stamp of the General Examinations Department, under the Ministry of Education. Final high school diploma obtained from Egypt, stamped by the school + stamp of the U.S. Accreditation Institution + stamp of the General Examinations Department, under the Ministry of Education. Certificates obtained from Egypt must be presented with a formal notification from the school. Original EST score(s)/ACT stamped by The General Examinations Department, under the Ministry of Education. Student must provide the Admission Department with their username and password for their account for the College Board of SAT exam(s) or EST For certificates obtained from schools outside Egypt, a stamp of the school and the Ministry of Education, a stamp of the Ministry of Foreign Affairs of the country of the certificate, and a stamp of the Egyptian Embassy in the country of the certificate are required. For certificates obtained from schools outside Egypt, an accreditation letter from AMIDEAST (stamped by AMIDEAST and the Ministry of Foreign Affairs) is required. Preparatory School Certificate (National System) or proof of 12 years (International System) of schooling stamped by the school and certified by the educational zone the school belongs to. If proof of 12 years of schooling is obtained from outside Egypt, the required stamps are School stamp Stamp of the Educational Zone The stamp of the Egyptian Embassy in that foreign country Original birth certificate. 6 personal photos. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. IGCSE Image IGCSE slips stamped by the British Council + stamp of the Ministry of Foreign Affairs + stamp of the General Examinations Department, under the Ministry of Education. IGCSE slips are obtained from outside Egypt, stamped by the British Council + the stamp of the Ministry of Foreign Affairs, and the stamp of the Egyptian Embassy in the country of the certificate(s). Preparatory Stage Certificate (National System) or proof of 12 years of schooling (International System) stamped by the school and certified by the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs A stamp of the Egyptian Embassy in the foreign country. Original birth certificate. 6 personal photos. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. Nile Certificate Image Nile certificate slips stamped by the General Examinations Department, under the Ministry of Education. Preparatory Stage Certificate (National System) or Proof of 12 Years of Schooling (International System) stamped by the school + stamp of the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs A stamp of the Egyptian Embassy in a foreign country. Original birth certificate. 6 personal photos. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. International Baccalaureate Image Final IB Transcript stamped by the authorities concerned in Genève, Switzerland + stamp of the Egyptian Embassy in Switzerland + stamp of the General Examinations Department, under the Ministry of Education. Final IB Graduation Diploma stamped by the authorities concerned in Genève, Switzerland + stamp of the Egyptian Embassy in Switzerland + stamp of the General Examinations Department, under the Ministry of Education. For IB certificate holders from outside Egypt, the required certificates must be stamped by the authorities concerned in Geneva, Switzerland, plus the stamp of the Egyptian Embassy in Switzerland Preparatory Stage Certificate (National system) or proof of 12 years of schooling (International system) stamped by the school and certified by the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs A stamp of the Egyptian Embassy in a foreign country. Original birth certificate. 6 personal photos. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. French Baccalaureate Image Final original “Baccalaureate General” stamped by the school and the accreditation institute (e.g. Academie de Lyon) and certified by the French Embassy in Egypt, the Ministry of Foreign Affairs, Cairo, and the stamp of The General Examinations Department, under the Ministry of Education. Preparatory Stage Certificate (National System) or Proof of 12 Years of Schooling (International System) stamped by the school and certified by the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are: School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs A stamp of the Egyptian Embassy in a foreign country. The French Brevet is accepted as complete proof and must be stamped by the school and the accreditation institute (e.g., Academie de Lyon) and certified by the French Embassy in Egypt and the Ministry of Foreign Affairs. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2005 and before. Original Birth Certificate. 6 personal photos. *All documents will be examined by the Supreme Council of Higher Education for final approval. Canadian Certificate Image The final Canadian high school transcript from Egypt must be stamped by the school and certified. Ministry of Foreign Affairs in Canada, Egyptian Embassy in Canada, stamp of \"The General Examinations Department, under the Ministry of Education.\" OR Authentication stamp from a notary public, the Canadian Embassy in Cairo, the Ministry of Foreign Affairs in Cairo, and the stamp of the General Examinations Department, under the Ministry of Education. Final Canadian high school transcripts obtained from outside Egypt require Preparatory stage certificate (national system) or proof of 12 years of schooling (international system) stamped by the school and certified by the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs A stamp of the Egyptian Embassy in a foreign country. Original document of Arabic and Religion exams (for Egyptian and Arab students). Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. Original Birth Certificate. 6 personal photos. *All documents will be examined by the Supreme Council of Higher Education for final approval. German Abitur Image Abitur certificate stamped by the school and the German Embassy and certified by the Ministry of Foreign Affairs + stamp of the General Examinations Department, under the Ministry of Education Preparatory Stage Certificate (National System) or proof of 12 years of schooling (International System) stamped by the school and certified by the educational zone the school belongs to. Proof of 12 years of schooling is obtained from outside Egypt, and the required stamps are School stamp Stamp of the Educational Zone Stamp of the Ministry of Foreign Affairs The stamp of the Egyptian Embassy in a foreign country. Original document of Arabic and Religion exams (for Egyptian and Arab students). Original Birth Certificate. 6 personal photos. Namouzag 2 Gond (required from Egyptian male students only). Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval. Other Certificates (General) Image Original high school certificate Original Birth certificate 6 passport-size photos Military Service Form (Namouzag 2 Gond) for Egyptian male students only. Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Council of Higher Education for final approval", "length": 1775}
{"url": "https://eui.edu.eg/scholarships", "chunk_index": 0, "text": "Skip to main content Scholarships Image Scholarships Explore a range of scholarships at EUI, including full, merit-based, and athletic ones. Full & Partial Scholarships for Egyptian students EUI is proud to offer full and partial scholarships to Egyptian students for the academic year 2025-2026, helping to make higher education more accessible and affordable. 25 scholarships funded by EUI More Details Prof. Reem Bahgat's  Full Scholarship More Details Partial scholarships for Egyptian students based on merit More Details Scholarships for Continuing students More Details Athletic Scholarships More Details Additional Scholarships More Details Previous Full Scholarships for Egyptian students More Details Sawiris Full Scholarships for top students More Details Students from Sudan and Crisis-impacted Arab Countries More Details", "length": 116}
{"url": "https://eui.edu.eg/financial-aid", "chunk_index": 0, "text": "Skip to main content Financial Aid For existing students only Egypt University of Informatics (EUI) offers a financial aid program to existing students who face significant financial challenges, contingent upon the dedicated committee's thorough evaluation of their financial circumstances. To apply, please send an email to [email protected] . You can check the rules and regulations of the financial aid program through this link", "length": 64}
{"url": "https://eui.edu.eg/academic-calendar", "chunk_index": 0, "text": "Skip to main content Academic Calendar Image Academic Calendar Gray background", "length": 11}
{"url": "https://eui.edu.eg/tuition-fees", "chunk_index": 0, "text": "Skip to main content Tuition Fees Image Tuition Fees For 2025-2026 cohort Annual Tuition Fees for Egyptian & Non-Egyptian students (2025-2026) Image Faculty of Engineering Tuition Fees for Egyptian & Non-Egyptian students for 2025-2026 Scholarships based on Academic merit Category C Fees before Academic Scholarships 153510 EGP Category B 135450 EGP Category A 108360 EGP Non-Egyptian 7500 USD Image Faculty of Computing and Information Sciences Tuition Fees for Egyptian & Non-Egyptian students for 2025-2026 Scholarships based on Academic merit Category C Fees before Academic Scholarships 146540 EGP Category B 129300 EGP Category A 103440 EGP Non-Egyptian 7500 USD Image Faculty of Business Informatics Tuition Fees for Egyptian & Non-Egyptian students for 2025-2026 Scholarships based on Academic merit Category C Fees before Academic Scholarships 131360 EGP Category B 123150 EGP Category A 90310 EGP Non-Egyptian 6500 USD Image Faculty of Digital Arts and Design Tuition Fees for Egyptian & Non-Egyptian students for 2025-2026 Scholarships based on Academic merit Category C Fees before Academic Scholarships 141900 EGP Category B 132440 EGP Category A 104060 EGP Non-Egyptian 7500 USD Additional fees and other costs Application Fee one time  (non-refundable) 1500 EGP In case of English Placement  Test is needed ( Non-refundable) 950 EGP Administrative Fee (Non-refundable) 13000 EGP Facilities & Labs usage  (non-refundable) annually. The student is accountable to cover any costs Incurred due to damages. 2500 EGP Category Definition Category C is equivalent to the tuition fees for the 2025-2026 cohort before the scholarships based on academic merit. Category B is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma (Maths and Science sections) for scores 80% to less than 90% for the science section and 70% to less than 80% for the literature section Category A is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma for scores of 90% or more for the science section and 80% or more for the literature section. Tuition Fees Rules and Regulations The tuition fees include medical insurance against emergencies inside and outside the campus. Tuition fees are subject to an annual increase. These fees don’t include transportation or accommodation fees. Tuition fees are paid for each semester before it begins. fees background Bank Details for Egyptians Image Bank Name: Commercial International Bank Branch Name: Smart Village IBAN: EG970010011900000100049475138 Account Name: Egypt University of Informatics Account Number: 100049475138 Currency: EGP Bank Details for Non-Egyptians Image Bank Name: Commercial International Bank Branch Name: Smart Village I Ban: EG250010011900000100049475173 Account Name: Egypt University of Informatics Account No: 100049475173 Currency: USD", "length": 432}
{"url": "https://eui.edu.eg/dorms", "chunk_index": 0, "text": "Skip to main content Dorms Image Dorms Your Home Away from Home Image Dorms Egypt University of Informatics (EUI) provides fully furnished dormitory accommodations for students from outside the Cairo and Giza governorates in Al Rehab City and fully equipped hotel rooms at the Jasmine Inn Hotel in Badr City. Students staying at the dormitories benefit from a range of services, including: Image Internet Connection High-speed internet access is provided to ensure students stay connected. Image Fully Furnished Accommodation The dormitories are equipped with all necessary furniture for comfortable living. Image Cleaning service once per week A cleaning service is provided once per week to maintain a clean and hygienic living environment Image 24/7 security Security personnel are available round the clock to ensure the safety and security of the dormitory premises. Image Proximity to Shopping Malls and Convenience Stores The dormitories are conveniently located within walking distance of shopping malls and convenience stores, providing easy access to essential amenities and facilities for students' convenience. \"Stay tuned for the new dorm fees for the 2025–2026 academic year.\" For further inquiries about the dorms, please reach out to the facilities team at [email protected] or call 01030085060.", "length": 196}
{"url": "https://eui.edu.eg/transportation", "chunk_index": 0, "text": "EUI takes pride in offering convenient bus routes to serve students commuting from Greater Cairo, 6th of October City, and New Cairo. These bus routes are meticulously designed to ensure efficient transportation, catering to the diverse needs of our student body. With regular and reliable service, students can count on timely arrivals and departures, facilitating seamless travel to and from campus. Our bus routes provide a safe and convenient way for students to access the university, fostering a sense of community and accessibility across various regions.", "length": 86}
{"url": "https://eui.edu.eg/transportation", "chunk_index": 1, "text": "EUI takes pride in offering convenient bus routes to serve students commuting from Greater Cairo, 6th of October City, and New Cairo. These bus routes are meticulously designed to ensure efficient transportation, catering to the diverse needs of our student body. With regular and reliable service, students can count on timely arrivals and departures, facilitating seamless travel to and from campus. Our bus routes provide a safe and convenient way for students to access the university, fostering a sense of community and accessibility across various regions.", "length": 86}
{"url": "https://eui.edu.eg/conditional-acceptance-fall-2025", "chunk_index": 0, "text": "Skip to main content Conditional Acceptance Fees for Fall 2025 Stay Tuned for the tuition fees for the academic year 2025/2026! Upon receiving Conditional Acceptance, applicants for Fall 2025 are required to pay 30,000 LE, which includes a non-refundable administrative fee of 13,000 LE. If an applicant wishes to withdraw their application, a refund of 17,000 LE (30,000 LE minus the 13,000 LE non-refundable administrative fee) will be granted if the withdrawal request is made WITHIN a week of receiving your high school certificates. For withdrawals submitted AFTER  a week of receiving your high school certificates , refunds will be processed per the refund policy set by the Ministry of Higher Education and Scientific Research, as follows: Before the start of the academic year : A 10% deduction (1,700 LE) from the refundable amount . Within one month of the start of the academic year : A 50% deduction (8,500 LE) from the refundable amount More than one month after the start of the academic year : No refund (100% deduction of the refundable amount, totaling 17,000 LE)", "length": 178}
{"url": "https://eui.edu.eg/faculty-engineering/home", "chunk_index": 0, "text": "Skip to main content Faculty of Engineering Image Faculty of Engineering Engineer your Future today! About the Faculty The Faculty of Engineering is home to four dynamic academic programs, each focused on the forefront of modern technological engineering. Our exceptional faculty, boasting world-class expertise, is dedicated to pioneering research and delivering cutting-edge education. We're committed to equipping our students with the latest scientific knowledge, shaping them into tomorrow's engineering leaders. Our strong alliances with leading local and international companies ensure that our students tackle real-world engineering challenges head-on. These partnerships empower our students to craft innovative, practical solutions, preparing them to excel and make a lasting impact in the engineering world. Image 31 Staff Members Image 1 Bachelor degree dual degree agreement Image 3 Open Programs Image 550 Enrolled Students Message from the Dean Dean Prof. Ashraf Mahran Dear EUI Community, Greetings from the Faculty of Engineering, where every stride reverberates with the melody of aspirations soaring and innovation driving advancement! As the Dean, it is my privilege to warmly welcome you into our lively congregation of dreamers, solution-seekers, and pioneers. Here, creativity flourishes, collaboration thrives, and excellence is not just a goal but a way of life. Together, we challenge conventions, expand horizons and engineer a world where possibilities know no bounds. Welcome aboard, and let's embark on this exhilarating journey of exploration and innovation side by side! Greetings from the Faculty of Engineering, where every stride reverberates with the melody of aspirations soaring and innovation driving advancement! As the  Dean, it is my privilege to warmly welcome you into our lively congregation of dreamers, solution-seekers, and pioneers. Meet The Dean Programs Image Electronics & Communication Engineering Image Computer Engineering Image Mechatronics Engineering Image Industrial Engineering (starting soon) prev next Tuition Fees for Egyptian Students Tuition Fees for Egyptian Students 2025-2026 Category A Scholarships based on academic merit 108360 EGP Category B Scholarships based on academic merit 135450 EGP Category C Fees before scholarships 153510 EGP Tuition Fees for Non-Egyptian students Tuition Fees for Non-Egyptian students for 2025-2026 Non-Egyptian Students 7500 USD Additional fees and other costs Academic Year 2025-2026 Application Fee to be paid once (non-refundable) 1500 EGP Administration Fee to be paid once (non-refundable) 13000 EGP In case of English Placement  Test is needed (Non-refundable) 950 EGP Facilities & Labs usage Non-refundable 2500 EGP Tuition Fees Rules & Regulations Academic Year 2025-2026 Category Definition Category C is equivalent to the tuition fees for 2025-2026 cohort before the scholarships based on academic merit. Category B is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma (Maths and Science sections) for scores 80% to less than 90% for the science section and 70% to less than 80% for the literature section ( for the Faculties of Business Informatics & Digital Arts and Design) Category A is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma for scores of 90% or more for the science section and 80% or more for the literature section ( for the Faculties of Business Informatics & Digital Arts and Design) Tuition Fees Rules and Regulations The tuition fees include medical insurance against emergencies inside and outside the campus. Tuition fees are subject to an annual increase. These fees don’t include transportation or accommodation fees. Tuition fees are paid for each semester before it begins. If the student would like to join the dual degree program with the international university, the fees of the blended courses and the cost of the one-year study abroad will need to be paid. The cost for the blended courses differs from one university to the other. You can check the fees on the partner university’s website. If the student enrolls in either the English foundation courses ( 1 and /or 2) or the Math fundamentals course, each course will be financially considered equivalent to a 3-credit hour course. Scholarships based on academic merit awarded for Egyptian students after the first year of enrollment are subject to adjustments based on the student's cumulative GPA. Students with a cumulative GPA of 3.4 or higher fall under Category A, while those with a cumulative GPA of at least 3.2 are placed in Category B. Additionally, students may transition from Categories A or B to C if their CGPA falls below 3.2. Dual degree with Purdue West Lafayette Media Gallery prev next", "length": 737}
{"url": "https://eui.edu.eg/faculty-computing-information-sciences/home", "chunk_index": 0, "text": "Computing and Information Sciences", "length": 4}
{"url": "https://eui.edu.eg/faculty-business-informatics/home", "chunk_index": 0, "text": "Skip to main content Faculty of Business Informatics Image Faculty of Business Informatics About us The Faculty of Business Informatics offers a distinguished Bachelor of Business Administration degree designed at the convergence of business strategy, digital innovation, and data-driven decision-making. With a forward-looking curriculum, the faculty equips students to meet the complex demands of today’s dynamic and technology-intensive global economy. Our programs integrate critical disciplines such as Business Analytics, Business Technology Management, Digital Marketing, and E-Commerce. This multidisciplinary approach empowers students to lead, innovate, and adapt effectively across diverse business and digital ecosystems. Grounded in academic excellence, our teaching philosophy emphasizes both theoretical rigor and practical relevance. Through immersive project-based learning, real-world internships, industry engagement, and case-based analysis, students develop the analytical acumen and strategic insight required to address contemporary business challenges and to devise transformative digital solutions. The faculty maintains a steadfast commitment to fostering innovation, entrepreneurship, and sustainability. We cultivate critical thinking, creativity, and principled leadership through strategic partnerships with leading private-sector organizations, startups, and global institutions. Our graduates emerge as future-ready professionals, prepared to drive impactful change and lead with integrity in a fast-evolving digital world. Image 20 Staff Members Image 1 Dual degree agreement Image 4 Open Programs Image 500 Enrolled Students Message from the Dean Prof. Mohamed Saleh Dear EUI Community, Welcome to the Faculty of Business Informatics, where the fusion of innovation and entrepreneurship defines the digital landscape! As the Dean, it brings me great joy to extend a heartfelt welcome to our students, parents, faculty members, and esteemed partners. Here, within our faculty, we unite business strategy with technological advancement, focusing on emerging fields such as Business Analytics, Business Technology Management, Digital Marketing, and E-commerce. This convergence creates fertile ground for innovation, sustainability, and the flourishing of our graduates. Together, we embrace the opportunities that lie ahead, cultivate curiosity, and inspire greatness in one another. Meet The Dean Programs Image Business Analytics Image Business Technology Management Image Digital Marketing & E-commerce Image Finance Image Accounting (starting soon) Image Entrepreurship & Innovation (starting soon) prev next Tuition Fees for Egyptian students Tuition Fees for Egyptian Students for 2025-2026 Category A Scholarships based on academic merit 90310 EGP Category B Scholarships based on academic merit 123150 EGP Category C Fees before scholarships 131360 EGP Tuition Fees for  Non-Egyptian students Tuition Fees for  Non-Egyptian students for 2024-2025 Tuition Fees for Non Egyptians For Academic Year 2025-2026 6500 USD Additional fees and other costs Academic Year 2025-2026 Application Fee to be paid once (non-refundable) 1500 EGP Administration Fee to be paid once (non-refundable) 13000 EGP In case of English Placement  Test is needed (Non-refundable) 950 EGP Facilities & Labs usage Non-refundable 2500 EGP Tuition Fees Rules & Regulations Academic Year 2025-2026 Category Definition Category C is equivalent to the tuition fees for the 2025-2026 cohort before the scholarships based on academic merit. Category B is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma (Maths and Science sections) for scores 80% to less than 90% for the science section and 70% to less than 80% for the literature section (for the Faculties of Business Informatics & Digital Arts and Design). Category A is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma for scores of 90% or more for the science section and 80% or more for the literature section (for the Faculties of Business Informatics & Digital Arts and Design). Tuition Fees Rules & Regulations The tuition fees include medical insurance against emergencies inside and outside the campus. Tuition fees are subject to an annual increase. These fees don’t include transportation or accommodation fees. Tuition fees are paid for each semester before it begins. The student is accountable to cover any costs Incurred due to damages. If the student would like to join the dual degree program with the international university, the fees of the blended courses and the cost of the one-year study abroad will need to be paid. The cost for the blended courses differ from one university to the other. You can check the fees on the partner university’s website. If the student enrolls in either the English foundation courses ( 1 and /or 2) or the Math fundamentals course, each course will be financially considered equivalent to a 3-credit hour course. Scholarships based on academic merit awarded for Egyptian students after the first year of enrollment are subject to adjustments based on the student's cumulative GPA. Students with a cumulative GPA of 3.4 or higher fall under Category A, while those with a cumulative GPA of at least 3.2 are placed in Category B. Additionally, students may transition from Categories A or B to C if their CGPA falls below 3.2. BI EUIans Media Gallery prev next", "length": 803}
{"url": "https://eui.edu.eg/faculty-digital-arts-and-design/home", "chunk_index": 0, "text": "Skip to main content Faculty of Digital Arts and Design Image Faculty of Digital Arts and Design Animation Arts & Digital Interior Design programs are now open! Apply now About us At the Faculty of Digital Arts and Design, creativity is at the heart of everything we do. We are a vibrant community of artists, designers, and innovators who are passionate about exploring the endless possibilities at the intersection of technology and art. Our faculty is a space where imagination takes flight—where ideas are transformed into compelling digital experiences that inspire, engage, and challenge the ordinary. Led by a visionary team and driven by a spirit of experimentation, we encourage our students to push the boundaries of self-expression and innovation. Whether you're interested in animation, interactive media, visual storytelling, or digital design, this is the place to shape your creative identity and bring your vision to life. Join us on a journey of discovery and transformation, as we redefine what it means to create in the digital age. Image 12 Staff Members Image 4 Open Programs Image 300 Enrolled Students Message from the Dean Dean Prof. Ashraf Zaki Welcome to the Faculty of Digital Arts and Design, where the spotlight shines on creativity! As the Dean, it fills me with excitement to extend a warm welcome to you into our dynamic community of artists, innovators, and visionaries. Here, we dive headfirst into the boundless realm of digital media and design, where imagination knows no limits. Together, let's blur the boundaries between technology and art, crafting immersive experiences that ignite inspiration and leave audiences spellbound. Welcome aboard, and let's embark on a thrilling voyage of self-expression and innovation, charting new territories and pushing the boundaries of what's possible! Welcome aboard, and let's embark on a thrilling voyage of self-expression and innovation, charting new territories and pushing the boundaries of what's possible! Meet The Dean Programs Image Game Design Image User Experience Design Image Digital Interior Design Image Animation Arts Image Graphic and Media Design (starting soon) Image Interaction Design Arts (starting soon) Image New Media Arts (starting soon) prev next Tuition Fees for Egyptian students Tuition Fees for Egyptian students for 2025-2026 Category A Scholarships based on academic merit 104060 EGP Category B Scholarships based on academic merit 132440 EGP Category C Fees before scholarships 141900 EGP Tuition Fees for Non-Egyptian students Tuition Fees for Non-Egyptian students for 2025-2026 Tuition Fees for Non Egyptians For Academic Year 2025-2026 7500 USD Additional fees and other costs Academic Year 2025-2026 Application Fee to be paid once (non-refundable) 1500 EGP Administration Fee to be paid once (non-refundable) 13000 EGP In case of English Placement  Test is needed (Non-refundable) 950 EGP Facilities & Labs usage Non-refundable 2500 EGP Tuition Fees Rules & Regulations Academic Year 2025-2026 Category Definition Category C is equivalent to the tuition fees for the 2025-2026 cohort before the scholarships based on academic merit. Category B is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma (Maths and Science sections) for scores 80% to less than 90% for the science section and 70% to less than 80% for the literature section (for the Faculties of Business Informatics & Digital Arts and Design). Category A is equivalent to the partial scholarship based on academic merit for the 2025-2026 cohort of Holders of Thanaweya Amma for scores of 90% or more for the science section and 80% or more for the literature section (for the Faculties of Business Informatics & Digital Arts and Design). Tuition Fees Rules and Regulations: The tuition fees include medical insurance against emergencies inside and outside the campus. Tuition fees are subject to an annual increase. These fees don’t include transportation or accommodation fees. Tuition fees are paid for each semester before it begins. The student is accountable to cover any costs Incurred due to damages. If the student would like to join the dual degree program with the international university, the fees of the blended courses and the cost of the one-year study abroad will need to be paid. The cost for the blended courses differs from one university to the other. You can check the fees on the partner university’s website. If the student enrolls in either the English foundation courses ( 1 and /or 2) or the Math fundamentals course, each course will be financially considered equivalent to a 3-credit hour course. Scholarships based on academic merit awarded for Egyptian students after the first year of enrollment are subject to adjustments based on the student's cumulative GPA. Students with a cumulative GPA of 3.4 or higher fall under Category A, while those with a cumulative GPA of at least 3.2 are placed in Category B. Additionally, students may transition from Categories A or B to C if their CGPA falls below 3.2. Creative EUIans! Media Gallery prev next", "length": 810}
{"url": "https://eui.edu.eg/EUIlibrary", "chunk_index": 0, "text": "Skip to main content Library EUI's Library EUI's Library offers a range of resources and services to support students’ academic needs: Electronic Books and Publishers: Students have access to top publisher platforms, including Cengage Learning, Macmillan Education, and Cambridge University Press, allowing them to browse and locate textbooks and relevant technologies. Databases and E-Journals: As a member of the Egyptian Knowledge Bank (EKB) Universities, EUI provides access to numerous databases and e-journals, available through the EKB portal. These include ScienceDirect by Elsevier, IEEE Xplore Digital Library, and Springer Materials, offering a vast selection of academic and scientific resources. Library Collection: EUI Library supports both electronic and printed book collections. Students can borrow physical books and also benefit from a variety of e-resources. Library Services: Document Delivery: Assistance in acquiring specific documents. Book Services: Students can borrow, renew, and request books as needed. Training and Skill Development: Resources and support for enhancing research skills. Librarian Support: Students can reach out to librarians for assistance with their research or resource needs. Photocopying: Photocopy services are available for students to access printed materials conveniently. Image Library's Partner Publishers", "length": 185}
{"url": "https://eui.edu.eg/english-department", "chunk_index": 0, "text": "Skip to main content English Department English Department The English language program is designed to fulfill the English language proficiency required for studying at EUI’s different faculties according to the different faculties’ Bylaws, since the language of instruction is English. EUI uses the computer-based Pearson Versant Placement Test to place students according to their placement test score as follows: Students with score 20 – 38 are placed in the First English Foundation Course (HUM001) when starting in the Fall Semester. Students with score 39 – 56 are placed in the Second English Foundation Course (HUM002) when starting in the Fall Semester. Students with score 57+ would start their first English credit course when starting in the Fall Semester. The English Department provides an excellent opportunity to students who are weak in English by providing two non-credit courses of General English (HUM001 & HUM002) according to the students’ English language level needs and placement test score (as stated above). The program is tailored to meet the challenges of the 21st century, and it also trains students to use their critical thinking, evaluation and analysis skills in order to be prepared for the competition of the job market. The English language credit courses provided at EUI’s different faculties are as follows: Business English This course is designed to prepare students to use English in the future work situation. Students will develop English skills with a focus on business contexts and environments, and they will learn vocabulary that is used regularly in the business world. This course will help practice and enrich communication and work-related skills like meetings, negotiations, bargaining, in addition to writing business emails and reports. All skills are taught by using English in specific business settings and situations. Academic Writing This course prepares students to handle reading academic textbooks (reading academic texts effectively and critically) as well as paraphrasing, summarizing, and synthesizing what they read. It also prepares the students for writing an academic argumentative essay which is the basis for research paper writing. Technical Writing This course is an advanced-level course that requires extensive reading and writing. It covers the information about writing from the prewriting stages of planning and organization through actual writing, revision and editing. Students get to work on several projects to create different kinds of technical documents while conscious of the principles of audience analysis and document design. Image", "length": 394}
{"url": "https://eui.edu.eg/campus-life", "chunk_index": 0, "text": "Skip to main content Campus Life Image Campus Life EUI...Where Every Day is a New Experience EUI's Student Union President: Abdelrahman Khaled Vice-President: Fouad Ahmed Fouad Ali Student Committees: Organization Committee: Zina Khaled Salah (Chair), Seif Mohamed Wafiq (Deputy) Art Committee: Kenzy Tarek Hussein (Chair), Yasmin Mohamed Mahmoud El-Shafei (Deputy) Sports Committee: Murad Emad El-Shorbagy (Chair), Abdullah Yasser Abdelhamid Mahmod Helmy (Deputy) Culture Committee: Sajed Samer Ibrahim Mohamed (Chair), Ahmed Mahmoud Mohamed Zeytoun (Deputy) Scouting Committee: Noor Ahmed Abdelwahab Metwally (Chair), Ziad Walid Abdelaziz Abduljied (Deputy) Social & Trips Committee: Ziad Ahmed Fathy Abbas (Chair), Seifeddine Mohamed Ahmed Nabil (Deputy) Scientific Committee: Omar Mohamed Said Wafa Hassan (Chair), Noor Elhoda Hany Abu Elwafa Ahmed (Deputy) Image Image Cybersecurity Club (CIS) The Cybersecurity Club is committed to preparing future experts by providing essential skills and knowledge to confront modern threats. Through a mix of education and hands-on training, members learn defensive and offensive strategies in cybersecurity. Image Knowledge Seekers Club The Knowledge Seekers Club at EUI sets out on a quest for cultural exploration and intellectual enlightenment. It provides a variety of activities designed to quench the thirst for knowledge and adventure, such as interactive workshops, enlightening talks, cultural showcases, historical outings, to delve into the mysteries of our past at museums and landmarks, and fun competitions, to test the knowledge and creativity in friendly competitions that blend learning with excitement. Image Enactus Club (BI) ENACTUS stands as a dynamic student organization committed to nurturing future business leaders who aspire to make positive impacts within their communities. Through entrepreneurial action, members of ENACTUS strive to develop sustainable projects that address a wide range of social, economic, and environmental challenges. Image Marketing Informatics Club (MIC) MIC is dedicated to fostering knowledge in marketing informatics, providing a platform for members to expand their expertise through workshops, seminars, and guest speaker sessions. With a focus on data analysis, marketing automation, and digital marketing technologies, the club offers practical opportunities for students to enhance their skills and understanding in this dynamic field. Image Game Dev Club The GameDev Club is a student organization focused on introducing university students to game development. Members acquire game programming skills and delve into fundamental game design concepts. They engage in gaming events, providing a platform to showcase projects and connect with like-minded peers. This fosters a vibrant community of aspiring game developers, promoting collaborative learning and exciting project endeavors. Image IEEE Student Branch Club  ( Engineering) Established in 2023, the IEEE EUI Student Branch aims to promote academic and professional excellence among engineering students. Led by faculty and student representatives, the club provides a platform for networking, skill development, and collaboration within the engineering community. Image Odyssey Club Odyssey Club takes pride in organizing a diverse range of student trips and activities designed to enrich the university experience beyond the classroom. From adventurous outdoor excursions to cultural outings, the club ensures there's something for everyone to enjoy, fostering a vibrant and inclusive campus community. Image Rally Society-EUI The Rally Society at EUI emerged through collaboration with the AAST Entrepreneurship Center, aimed at fostering entrepreneurial spirit among students. Its primary objective is to cultivate, support, and implement innovative ideas proposed by students. Central to the club's mission is promoting the Rally competition within EUI, encouraging students to participate by submitting their inventive concepts. Subsequently, a select number of teams advance to the subsequent stages of the competition. Image WeDev Club (CIS) WeDev is the gateway to mastering web development. Members explore the intricacies of website creation and maintenance. Members gain hands-on experience in designing and constructing websites, tackling real-world challenges. By exploring both frontend and backend technologies, they become equipped to thrive as full-stack developers. Image Visage Club Visage embodies a dynamic collective of Digital Arts and Design students, uniting creative minds with a shared passion for reshaping the visual identity of our university events and clubs. With a blend of imaginative flair and technical proficiency, our skilled members infuse each project with designs that captivate the viewer while authentically reflecting the essence and atmosphere of every occasion. Image EUI-ICPC EUI-ICPC club thrives as an energetic and lively community, uniting individuals dedicated to competitive programming. Our core aim is to enhance coding and problem-solving proficiencies within our membership. Image EUI-MUN The  Model United Nations (MUN) Club at Egypt University of Informatics provides students with a platform to engage in global diplomacy, enhance public speaking, and develop negotiation skills. Members simulate real UN sessions, debate pressing international issues, and collaborate with peers to propose solutions, fostering leadership and a deeper understanding of world affairs. Image Stellaris EUI's Astronomy Club shares knowledge about space and astronomy while fostering a connection with nature. It organizes stargazing and camping trips to teach sky chart reading, star identification, and astrophotography. Our Champions At EUI, we take immense pride in our athletic students who are true champions on and off the field. Their dedication and hard work have led them to excel in regional, international, and local championships, bringing honor to our campus and setting a standard of excellence. Their achievements are a testament to their commitment and our support for their athletic and academic pursuits. Ahmed El-Gendy Gold Medalist for Modern Pentathlon Final - Paris Olympics 2024 Faculty of Business Informatics Mohamed El-Gendy Modern Pentathlon World Cup Gold Medalist – Hungary 2024 Faculty of Business Informatics Shahd Saeed Six-time medal winner at the National Speedball Championship, Egypt, 2023 Faculty of Computing and Information Sciences Maya Shalash Women's Individual Epee Fencing Championships Gold Winner, Lagos, 2022 Faculty of Computing and Information Sciences Zeina Amer Two Gold Medals Winner, World Universities Modern Pentathlon Championships, Lithuania, 2024 Faculty of Business Informatics Youssef Nagy Junior Handball Team Goalkeeper and Winner of Egypt vs. Hungary match, Estadat International Championship, Egypt, 2024 Faculty of Computing and Information Sciences Yehia Hassan Silver Medalist at the Arab Clubs' Youth Taekwondo Championships, Egypt, 2023 Faculty of Computing and Information Sciences", "length": 986}
{"url": "https://eui.edu.eg/360deg-student-support-framework", "chunk_index": 0, "text": "Skip to main content 360° Student Support Framework Image 360° Student Support Framework EUI: Where Every Student’s Potential Shines. In the vibrant landscape of Egypt's higher education, Egypt University of Informatics (EUI) stands as a beacon of excellence, diversity, and inclusivity. With a diverse student body representing various socio-economic backgrounds and abilities, EUI recognizes the paramount importance of providing comprehensive personalized support to ensure that every student thrives.EUI's support package is multifaceted, addressing diverse student needs comprehensively: Scholarships and Financial Support EUI's commitment to accessibility is evident through a range of financial support options, ensuring no student is barred from quality education due to financial constraints. Fee reductions (up to 100% scholarships) are based on academic merit as well as economic need. It is worth mentioning that 10% of EUI’s student body are amongst the Egyptian national high school certificates top students. The full scholarships offered to top students include tuition fees, transportation, and in some cases, accommodation. Moreover, up to 50% of the students scored above 85 - 90% in different national and international high school diplomas and are offered up to 65% discount on tuition fees based on academic scores. On the economic side, Financial support is available for students facing financial hardship. Image Geographical Diversity Due to providing student housing, EUI was able to welcome students with accessibility to adequate resources from across Egyptian governorates. EUI fosters an inclusive environment, enriching the educational experience through diverse perspectives. Image Accessibility for Students with Special Needs Our campus infrastructure and support services cater to students with learning differences, ensuring equal opportunities for all. For instance, exam time extensions and extra support are provided. Moreover, the campus is equipped with various accessibility means for students with physical disabilities to ensure a smooth on-campus experience. EUI also has a protocol of cooperation with the National Academy of Information Technology for Persons with Disabilities (NAID). Image Support for Athletes EUI recognizes the dedication of student athletes, providing tailored support to balance academic and athletic commitments seamlessly. The goal is to help the athletic thrive their academic performance while maintaining their athletic excellence. This includes recording lectures, offering one-on-one academic assistance, and facilitating on-campus training for professional athletes. It is worth noting that 7 of our athletes represent Egypt on the international and Olympic level in 4 sports, including Ahmed Elgendy, Gold Olympian at Paris Olympics 2024. Image Student Wellbeing and Community Service Beyond academics, EUI prioritizes student psychological wellbeing, offering counseling services and fostering a culture of community engagement and service. EUI nurtures student well-being providing support and offering one-on-one counseling services for students in need. Moreover, seminars and workshops are frequently conducted on campus and given by professional specialists on various topics such as Mental Wellbeing, Time Management, Stress Management, Nutrition Planning, and Building Safe and Healthy Relationships. Moreover, community services initiatives such as blood donation drives, clothing  and food donations are encouraged as part of community belonging. Image Career & Employability The Careers and Employability office (CEO) connects academia and ICT industry partners of multinational companies and emerging successful start-ups. The office offers students a range of capacity-building and skills development opportunities to boost their career options, plan their career paths, develop their skills, and network with recruiters and employers. The services provided include: Career planning and advising Character-building and soft skills Resume writing Interview tips & training Internships Image", "length": 560}
{"url": "https://eui.edu.eg/food-outlets", "chunk_index": 0, "text": "Skip to main content Food Outlets NOSH Cafeteria NOSH Cafeteria is now open on campus, offering a warm, welcoming space for students, faculty, and staff to unwind and enjoy a variety of snacks, meals, and beverages. With comfortable seating and a friendly atmosphere, NOSH is the perfect spot to relax, grab a quick bite, or catch up with friends. The menu features a range of options, including freshly prepared sandwiches, salads, pastries, fruit cups, smoothies, and a selection of coffee, tea, and specialty drinks. NOSH is also exploring daily specials and customizable dietary choices to ensure there's something for everyone. Image Cinnamon Factory Cinnamon Factory is a new food outlet on campus, offering a variety of cinnamon-based treats, including signature cinnamon rolls and pastries. Perfect for a quick snack or a sweet break, it provides a cozy spot to enjoy freshly baked goods and drinks, making it a great addition to campus dining options. Image", "length": 155}
{"url": "https://eui.edu.eg/wellbeing", "chunk_index": 0, "text": "Skip to main content Wellbeing Image Psychosocial Support With You Towards a Balanced University Life Welcome to the vibrant and dynamic Department of Student Life at Egypt University. We are committed to enriching your university experience through various units designed to cater to different aspects of student life. Explore the diverse opportunities available to you fees background Counseling and Psychological Support At EUI, we understand that academic success is not just about achieving good grades but also about maintaining a healthy and balanced lifestyle. Our well-being services are designed to support your academic success and personal well-being by providing confidential, accessible, and inclusive services. Image Confidential One-on-One Support Our confidential sessions provide a safe and non-judgmental space for EUIans to share their thoughts, feelings, and concerns with a trained professional. Everything discussed during these sessions remains confidential and is not shared with anyone else. Image Flexible Schedule Our flexible scheduling options allow EUIans to schedule sessions at a time that suits them best. Whether you're busy during the day or prefer to schedule sessions in the evening, we offer flexible scheduling to accommodate your needs. Image Regular Activities Our regular offerings provide a sense of security and familiarity for students throughout their academic journey to stay on track with their goals and aspirations. Image Interactive Sessions Our interactive sessions are designed to engage EUIans in a fun and interactive way, using activities such as games, role-playing, and group exercises to promote learning, growth, and connection. These sessions are often used to address specific topics or issues, such as stress management, communication skills, or team building. Image", "length": 266}
{"url": "https://eui.edu.eg/events", "chunk_index": 0, "text": "Skip to main content Events Image Upcoming Events Sorry, we couldn't find any results.", "length": 14}
{"url": "https://eui.edu.eg/previous-events", "chunk_index": 0, "text": "Skip to main content Previous Events Image Previous Events Aug 22 AI Catalyst V.03 22  August  2025 Address EUI Campus-Knowledge City - New Capital AI Catalyst V.03 is taking place on Friday, August 22, from 10:30 a.m. to 6:00 p.m. at the campus of Egypt University of Informatics (EUI) in the Knowledge City, New Administrative Capital. This event is held in collaboration between EUI’s Entrepreneurship and Innovation Center and DotPy.&nbsp;This year’s edition highlights the transformative role of artificial intelligence and software technologies. What once were specialized fields requiring niche expertise have now become global forces shaping every aspect of our lives and work—whether in business, marketing, healthcare, education, or beyond.With a broader and more inclusive scope, AI Catalyst V.03 is designed for everyone: students, graduates, and professionals from all backgrounds. The event will bring together international experts to share insights, engage in meaningful discussions, and inspire participants to envision their role in shaping the future.&nbsp;Agenda for AI Catalyst V.03 Aug 09 Main Segment 2025 9  August  2025 Address EUI Campus-Knowledge City - New Capital MAIN Segment is ASME Cairo University’s flagship, a one-day multidisciplinary event designed as a bridge between mechanical engineering fundamentals and the power of AI and data science. Scheduled for August 9, 2025, at &nbsp;Egypt University of Informatics (EUI), it’s co-hosted by ASME Cairo University and GDG EUI, in strategic partnership with EUIWhat Is the MAIN Segment?A dynamic fusion of workshops, talks, panels, and career-focused activities for students, graduates, and professionals.A unique theme centered around technology‑driven innovation in engineering through AI and data science integration.&nbsp;&nbsp;Main ActivitiesPanels featuring industry and academic experts discussing the future of AI-powered mechanical engineering solutions.Talks by leading voices in smart manufacturing, robotics, and machine learning.Hands-on sessions and workshops covering Industry 4.0, digital transformation, CFD, BIM, reverse engineering, supply chain innovations, sustainability, HVAC, and more.Career fair with top engineering and tech companies offering internships, jobs, and scholarships.Mentorship circles, CV/LinkedIn reviews, and mock interviews to hone professional readiness.&nbsp;Technical &amp; Professional BreakoutsSessions are diverse and practical, ideal for any laptop-ready attendee. Highlights include:The Future of AI in EngineeringIndustry 4.0 &amp; Digital TransformationData Analysis &amp; Predictive MaintenanceCFD simulations, BIM modeling, HVAC system designEntrepreneurship, supply chain tech, sustainability practicesSoft skills training and career strategy essentials&nbsp;Why Attend?Learn how AI is revolutionizing mechanical engineering.Network personally with recruiters and industry leaders.Get hands-on exposure to advanced tools and trending technologies.Improve your CV, LinkedIn, and interview techniques with expert feedback.Be part of Egypt’s first event merging mechanical and digital engineering minds.&nbsp;Event Guide and TicketingArrive early to secure your seat in workshops and labs.Bring an updated CV for career booths.Pre-book mentorship slots relevant to your interests.&nbsp;The ticket costs 200 EGP and grants full access to talks, panels, the career fair, two workshops (including materials), mock interviews, and CV review sessions.&nbsp; Aug 06 Digitopia Infosessions 6  August  2025 check more! Are you ready to start your journey to the future? 🚀The Ministry of Communications and Information Technology invites you to attend a series of introductory webinars for everyone interested in joining DIGITOPIA – the biggest tech competition in Egypt!You’ll also get the chance to ask all your questions about the competition — and we’ll answer them live.Each webinar will cover one of the three tracks you can submit your idea under:1. Games &amp; Digital Arts Track 🎮🎨If you have a vivid imagination, a talent for digital arts, or love designing interactive games — this session is for you!You’ll learn more about this track, the challenges you might face, and how to submit your idea.🗓 Date: Wednesday, August 6🕚 Time: 11:00 AM🔗 Join via Microsoft Teams2. Software &amp; Artificial Intelligence Track 🤖💡If you're passionate about coding and intelligent tech, join this session to understand the track's challenges, application steps, and how to develop your idea using AI to be ready for the competition.🗓 Date: Wednesday, August 6🕐 Time: 1:00 PM🔗 Join via Zoom3. Cybersecurity Track 🔐💻If you're passionate about protecting systems and data, and want to make a real impact — this session will walk you through the challenges, requirements, and how to submit a project that strengthens digital security and leaves a mark on society.🗓 Date: Wednesday, August 6🕒 Time: 3:00 PM🔗 Join via Microsoft Teams❗ Don’t miss the opportunity!Join the webinar that matches your field or passion — and take your first step toward the future with DIGITOPIA. Aug 03 EDUGATE- August 2025- 17th Edition 3  August  2025 Address Kempinski Royal Maxim Palace Hotel We are thrilled to announce our participation in EDUGATE Fair, taking place from August 3 to 5, 2025, from 10 am to 8 pm at Kempinski Royal Maxim Palace Hotel in New Cairo. Visit our booth and discover the endless opportunities awaiting you! Learn about our undergraduate programs in Communications and Information Technology, and get answers to your questions about our programs and admission requirements from our Admission and Registration team. Take advantage of the various scholarships available to support your academic journey and hear firsthand from current students about their experiences at EUI. Get a glimpse into our vibrant student life, and explore our dual degree agreements with top-ranked universities.Don't miss this chance to elevate your academic and professional prospects!&nbsp;The application is still open for Fall 2025. Apply now!&nbsp;&nbsp;&nbsp;We look forward to seeing you at EDUGATE Fair!&nbsp; Jul 29 Open Day 29  July  2025 Address Knowledge City, New Administrative Capital Get ready for an exciting day of discovery at EUI's Open Day on Tuesday, 29 July 2025, from 11:00 AM to 3:00 PM at our vibrant campus in Knowledge City, New Administrative Capital. Whether you're curious about our cutting-edge programs, interested in our smart dual degrees, or want a closer look at our dynamic faculties, this is your chance to experience EUI like never before!&nbsp;&nbsp;What to Expect?&nbsp;&nbsp;Explore our innovative academic programsKnow more about EUI's smart dual degrees with top-ranked universitiesMeet inspiring faculty members &amp; current EUIansTour our modern, high-tech campus facilitiesDive into the exciting world of EUI student lifeDiscover opportunities in Communications and Information Technology.&nbsp;Register now.&nbsp;&nbsp;***&nbsp;Free two-way transportation provided for all attendees! Jul 21 🎌 LAND A JOB OFFER IN JAPAN! 21  July  2025 Address Egypt University of Informatics Calling all students from EUI's Faculty of Computing and Information Sciences and the Faculty of EngineeringDon’t miss this special info session featuring Mr. Masato Sanpei, CEO of ASIA to JAPAN, about the \"LAND A JOB OFFER IN JAPAN! - FAST OFFER\" Program—your chance to:✅ Learn Japanese (Beginner to Intermediate Levels)✅ Join Monthly Interview Fairs✅ Get a Job Offer from Top Companies in Japan&nbsp;📅 Date: Monday, July 21, 2025🕙 Time: 10:00 AM – 12:00 PM📍 Venue: Room 318, Egypt University of Informatics (EUI)&nbsp;👨‍💻 Eligible Participants:Students majoring in Engineering or Computing and Information SciencesGraduation Years: • 2028 (N5 Level – Beginner) • 2027 (N4 Level – Upper Beginner) • 2026 (N3 Level – Intermediate)Keen to work in Japan after graduation🌟 Over 250 top companies are hiring through FAST OFFER, including Panasonic, Yamaha, SEGA, Honda, Rakuten, Mitsubishi Electric, and more! Jul 19 Ctrl+Z Heritage Exhibition 19  July  2025 Address Salah Taher Hall, Cairo Opera House The Faculty of Digital Arts &amp; Design cordially invites you to attend the \"Ctrl+Z Heritage Exhibition\", a celebration of digital innovation and cultural heritage and the result of months of research and creativity, where a new generation of student artists from the Faculty of Digital Arts &amp; Design reimagine heritage through the language of the digital age.\"Event Details:Date: 19–24 July 2025Opening Ceremony: Saturday, 19 July 2025, at 7:00 PM &nbsp;Official Opening: Monday, 21 July 2025, at 11 am, with the honorable presence of H.E. Dr. Amr Talaat, Minister of Communications and Information Technology.&nbsp;Venue: Salah Taher Hall, Cairo Opera House &nbsp;Exhibition Highlights:150+ unique artworks merging Egyptian and global heritage with cutting-edge digital techniques.Contributions from 50 talented EUI students, showcasing months of research and creativity.Interactive digital art experiences that redefine traditional storytelling.&nbsp;Exhibition Hours:Morning: 10:00 AM – 2:00 PM &nbsp;Evening: 4:30 PM – 8:30 PM &nbsp;Note: Admission is free for all visitors.&nbsp;This exhibition represents the culmination of our students' hard work, presenting a fresh perspective on reviving heritage through the lens of digital artistry. We would be honored by your presence to witness their remarkable achievements.We look forward to seeing you there!&nbsp; Jul 19 Build Your Future (BYF) Summit 2025 19  July  2025 Address https://maps.app.goo.gl/RK5txskDY34fgeH4A EUI is coming to the Build Your Future (BYF) Summit 2025. Be sure not to miss this exclusive opportunity to connect with us!Join us on July 19th, 2025 (11 AM to 9 PM), at Ghernata Palace, Heliopolis, where you'll meet our admission team, network with current EUIans, and discover why we're Egypt's leading ICT-specialized university for developing tomorrow's tech leaders.This is your chance to explore how EUI's industry-driven curriculum can propel your career in the digital revolution.&nbsp; Jul 08 IGE New Cairo Universities Fair 8  July  2025 Address Dusit Thani Lakeview Hotel EUI is excited to participate in the IGE New Cairo Universities Fair, taking place on the 8th and 9th of July 2025 at the Dusit Thani Lakeview Cairo Hotel. We welcome you to visit our booth between 12:00 PM and 9:00 PM to learn more about our unique academic programs, dual degrees, and dynamic campus life.Our team will be there to answer your questions and guide you through what EUI has to offer. Don’t miss the chance to take the next step toward a world-class education!&nbsp; Jun 24 Logistics Innovation Summit 24  June  2025 The Logistics Innovation Summit Egypt 2025 will take place on June 24th, 2025, at EUI campus in the New Administrative Capital. It is organized by Corelia, a Rioch Company, under the patronage of the Ministry of Communications and Information Technology, in collaboration with &nbsp;Egypt University of Informatics.&nbsp;You can access the agenda hereThe summit features a packed agenda, includingKeynote addresses on strategic vision, digital strategy, and technology leadership.Roundtable discussions on unlocking investment in logistics innovation, with insights from academics and industry leaders.Presentations by prominent figures, including the CEO of the Global Authority for Investments and Free Zones (GAP) and the Chief Innovation Officer of AGL.Interactive sessions, including startup technology demonstrations, B2B meetings, and networking opportunities.Closing remarks and recognition of collaborative efforts.The Logistics Innovation Summit brings together visionaries, innovators, and decision-makers to shape the future of logistics in Egypt and beyond.&nbsp; May 25 Open Day - 25 May 2025 25  May  2025 Address https://maps.app.goo.gl/fR4zW48x6hHmqizS8 Get ready for an exciting day of discovery at EUI's Open Day on Sunday, 25 May 2025, from 1:00 PM to 3:30 PM at our vibrant campus in Knowledge City, New Administrative Capital.Whether you're curious about our cutting-edge programs, interested in our smart dual degrees, or want a closer look at our dynamic faculties, this is your chance to experience EUI like never before!&nbsp;What to Expect?&nbsp;Explore our innovative academic programsKnow more about EUI's smart dual degrees with top-ranked universitiesMeet inspiring faculty members &amp; current EUIansTour our modern, high-tech campus facilitiesDive into the exciting world of EUI student lifeDiscover opportunities in Communications and Information TechnologyRegister now and come to feel the energy, see the innovation, and experience the excellence that make EUI truly one of a kind.***&nbsp;Free two-way transportation provided for all attendees!&nbsp;We can't wait to welcome you to EUI, where your future begins. May 25 EUI's First Career Fair 25  May  2025 Address Egypt University of Informatics EUI is proud to announce its first-ever Career Fair, which will take place on 25 and 26 May 2025 at our campus in the Knowledge City, New Administrative Capital.This exciting two-day event will bring together EUIans and leading employers. Whether you're exploring career options, looking to build connections, or recruiting top talent, the EUI Career Fair offers a unique platform to network, engage, and discover new opportunities.&nbsp;What to Expect?&nbsp;Employer Stands &amp; Networking: Meet representatives from international organizations, academic institutions, think tanks, NGOs, and private sector companies.Workshops &amp; Panels: Gain insights into career development, job market trends, and professional skills with sessions led by experts.CV Clinics &amp; Mock Interviews: Get personalized feedback to help you make a strong impression.&nbsp; Apr 10 Data Science and AI Conference ( DSC MENA 2025) 10  April  2025 Address Egypt University of Informatics Join the region’s premier tech-focused event, DSC MENA 25, uniting the AI and Data Science community to spark innovation and collaboration. This year’s conference will be the central hub for industry professionals, academics, and decision-makers to connect, share insights, and shape the future of AI in the MENA region.&nbsp;&nbsp;Event Highlights&nbsp;Dates: 10–12 April 2025Online Sessions &amp; Tutorials: 10–11 April 2025Physical Sessions with Keynote Speakers: 12 April 2025, held on EUI’s campus.&nbsp;&nbsp;Why should you attend?&nbsp;Dive into 100+ hours of premium, high-quality content designed to inspire and educate. You’ll also receive an Official DSC-signed Certificate of Attendance as an attendee, marking your participation in this transformative experience.Harness the power of DSC MENA 25 materials to deepen your expertise in visualization, data analytics, data science, and AI—a perfect opportunity to advance your skills and knowledge.Network in person with 1,500+ AI and Data professionals, business leaders, and researchers from across the region. Share ideas, collaborate, and forge connections that last beyond the conference.Stay ahead of the curve by exploring the latest advancements in ChatGPT, NLP, Robotics, Computer Vision, AI products, AGI, Open Data, Sports Analytics, Augmented Analytics, Applications, and much more.Seize the opportunity to discover why DSC MENA is the talk of the AI and Data community. Experience the captivating charm of Cairo, the heart of Egypt, while attending an event that stands out as a global landmark in the world of data and AI.Become part of the fastest-growing AI and Data community worldwide! Enjoy exclusive early access to events and premium content by joining this vibrant, innovative network.&nbsp;Program Overview&nbsp;Tracks &amp; Topics:Technical Track: Explore cutting-edge advancements in AI, Big Data Analytics, Augmented Analytics, NLP, Generative AI, Prompt Engineering, Data Visualization, Deploying ML Models, Data Engineering, Computer Vision, and Robotics.Public Policy &amp; Society Track: Delve into AI’s societal impacts and frameworks for responsible governance.Business Track: Discover how AI applications are transforming industries and enterprises.&nbsp;Be part of the community shaping the future of AI and Data Science in the MENA region and beyond.Don’t miss this opportunity to connect, learn, and innovate!&nbsp; Feb 23 EDUGATE 2025 23  February  2025 Address https://maps.app.goo.gl/pJS4iqpoxScgV2eg6 Explore the exciting opportunities awaiting you at EUI by visiting our booth at the EDUGATE Fair, from 23 to 25 February 2025 at Royal Maxim Palace Kempinski Hotel. Meet our dedicated representatives, who will be there to provide comprehensive information about our programs, admissions process, and unique student life. We're eager to answer all your questions and help you discover how EUI can be the launchpad for your future. Join us anytime between 10:00 AM and 8:00 PM—we can’t wait to meet you!&nbsp;&nbsp; Feb 17 Quantum Technologies: Opportunities and Challenges: \"Egypt Perspective\" 17  February  2025 Address Egypt University of Informatics The Quantum Technologies: Opportunities and Challenges workshop is a collaborative initiative between the Ministry of Communications and Information Technology (MCIT) and Egypt University of Informatics (EUI). On 17 &amp; 18 February 2025 at Knowledge City in the New Administrative Capital, the event will explore the transformative potential of quantum technologies within the Egyptian context.Agenda: Click here to view the workshop agenda for the two days.&nbsp;Speakers BIOs: Click here to view the speakers' BIOs.&nbsp;This workshop aims to:Gather leading experts, researchers, and industry professionals to share insights on the latest advancements in quantum technologies.Highlight emerging research directions and their implications for key industrial sectors in Egypt.Key Sessions:Scientific Session: Insights into cutting-edge quantum research.Industry Sessions: Two focused presentations by leading industry professionals on practical applications and market trends.Panel Discussion: A thought-provoking dialogue featuring experts on the opportunities and challenges of adopting quantum technologies in Egypt.&nbsp; Feb 15 EUI's Open Day 15  February  2025 Address https://maps.app.goo.gl/oCph32kDRdsczMaB8 What makes you stand out as an EUIan? While there’s one clear reason, you’ll uncover so much more about what it takes to become the next EUIan during our Open Day on Saturday, 15 &nbsp;February 2025, from 11:00 AM to 3:00 PM at our campus in the Knowledge City, New Administrative Capital.If you’re passionate about Information Technology and Communications and aspire to build a successful career in one of their related fields, this is your opportunity to discover why EUI is the perfect place to begin your journey.Explore our state-of-the-art facilities, meet our faculty members, and connect with current students who will share their experiences and insights into life at EUI. It’s your chance to envision your future and take the first step toward achieving your dreams.Seats are limited, so don’t wait! Register now to secure your spot and experience what makes EUI truly unique. To make things even easier, two-way transportation will be provided for your convenience.We can’t wait to welcome you on 15 February 2025! Feb 01 Explore X Summit 2025 1  February  2025 Address https://maps.app.goo.gl/xTJCMZZjvWskhqzf6 Meet EUI's representatives at Explore X Festival 2025 on Saturday, 1 February 2025, from 1:00 PM to 9:00 PM, at Taj City, Madinet Masr, and explore how EUI supports your journey from your first year to graduation and beyond. Connect with our Admissions Team to have all your questions answered. We can’t wait to welcome you!&nbsp;&nbsp;&nbsp;&nbsp; Dec 18 JAC -ECC Conference 2024 Closing Day 18  December  2024 The JAC-ECC conference 2024 &nbsp;is an annual meeting of international contributors, researchers, and scientists from Egypt and Japan. It will be held from 16 to 18 December 2024. The conference’s main theme is the exchange of knowledge and experiences among a diverse group of authors and experts in electronics, communications, and computer engineering. The event will feature state-of-the-art oral presentations, keynote speakers, special sessions, and tutorials related to the most recent and pressing research areas.The closing day will be held on 18 December 2024 at EUI's campus, offering a unique opportunity for participants to connect and reflect on the conference outcomes in a dynamic and inspiring academic environment.You can check the agenda for the final day here&nbsp;Conference Format:The three-day conference will include:Invited plenary lectures from pioneering international speakersSpecial sessions with invited expert speakersParallel sessions with oral presentationsTutorialsIcebreaker coffee breaks and conference lunchesExhibition booths (depending on interest from potential exhibitors)Expected Audience:Researchers working in the fields of interestStudents from public and private universities attending tutorialsStart-up companies and developers seeking to engage with international expertsManufacturers working in related areas of interest&nbsp; Dec 08 ZoneEd Foreign Students College & Career Fair 8  December  2024 Address Triumph Luxury Hotel- New Cairo If you’re an international expat aspiring to pursue your higher education in Egypt, don’t miss the chance to meet us at the ZoneEd Foreign Students College &amp; Career Fair on 8 December 2024. Join us at the Triumph Luxury Hotel, New Cairo, between 10:00 AM and 7:00 PM, and discover why EUI is the perfect destination for your academic ambitions.Explore how EUI combines cutting-edge facilities, dual-degree partnerships with globally top ranked universities, dynamic student life, and innovative academic programs and tracks to prepare you for a successful future.Applications are now open for Spring 2025 enrollment in the Faculties of Business Informatics and Computing and Information Sciences.&nbsp;Apply Now!&nbsp;Stay tuned for the upcoming launch EUI’s applications for Fall 2025 soon! Dec 06 EUI's Welcome Party 6  December  2024 Address Egypt University of Informatics Get ready for the BIGGEST event of the year at EUI’s campus in the Knowledge City, New Administrative Capital! The one and only Superstar Tamer Hosny is coming to ignite our Welcome Party on December 6th! Brace yourselves for an explosive night filled with electrifying music, nonstop energy, and pure excitement!Alongside the main show featuring the amazing Superstar Tamer Hosny, you’ll also enjoy performances by Disco Misr &amp; &nbsp;DJ Amr Saw and an amazing Tabla Show. It will be an electrifying night filled with music, dance, and unforgettable moments.Make sure to secure your invitation by visiting the link in the BIO and logging in using your student or staff ID. Don’t forget to grab an extra invitation for your companion.&nbsp;Get ready to dance the night away and create memories that will last a lifetime!&nbsp; Nov 22 Traverse Summit 2024 22  November  2024 EUI will attend the Traverse Summit 2024 at the Grand Egyptian Museum on November 22 and 23, 2024. You can visit us on November 22 from 2:00 PM to 9:00 PM and November 23 from 1:00 AM to 9:00 PM. Nov 17 Cairo ICT 17  November  2024 Address https://maps.app.goo.gl/ME8KhwDheqCjntWy6 Visit EUI at the Cairo ICT Fair, which will be held from November 17 to 20, 2024, at Egypt International Exhibition Center, Al Mosheer Axis.&nbsp; Nov 16 IGE New Cairo Universities Fair 16  November  2024 Address Dusit Thani Lakeview Hotel Visit EUI at the IGE New Cairo Universities Fair on November 16 and 17, from 12 pm to 9 pm at the Dusit Thani Lakeview Hotel.&nbsp;&nbsp; Nov 09 CESI International Digital Open Day 9  November  2024 All Computing and Information Sciences and Engineering EUIans are invited to attend the CESI International Digital Open Day on November 9, 2024.&nbsp;&nbsp;Programs offered: &nbsp;&nbsp;CESI Master’s Degree in Computer ScienceCESI Master’s Degree in Engineering&nbsp;CESI Bachelor’s Degree in Artificial intelligence&nbsp;CESI French Engineering Pathway&nbsp;Pre-masters Pathway&nbsp;CESI Summer Schools on AI adapted to the health sector, generative AI, AI and Innovation, Sustainable Construction, and Green Innovation&nbsp;**** The sessions will be conducted in EnglishDon’t miss this opportunity to explore the possibilities at CESI and ask questions in real-time! Register now for one of the three available sessions!&nbsp;For more information, please check your emails.&nbsp; Oct 29 Blood Donation Campaign 29  October  2024 Address Egypt University of Informatics The Student Life Office announces the organization of a blood donation campaign in collaboration with the Regional Blood Transfusion Center in Dar El Salam and the National Alliance for Civil Development Work. We invite faculty members, staff, and students to participate in this campaign, which will be held on October 29 and 30, 2024, from 9:00 AM to 4:00 PM on campus (entrance from the glass pyramid side). Oct 27 Basketball Tournament 27  October  2024 Address Egypt University of Informatics &nbsp;3*3 Basketball Tournament&nbsp;The 3*3 Basketball Tournament starts on 27 October 2024! Be sure to register by maximum 22 October 2024.&nbsp;Valuable prizes for the top 3 winning teams!Check your emails for more details. Oct 27 Soccer Tournament 27  October  2024 Address Egypt University of Informatics 5*5 Soccer Tournament&nbsp;Get ready for the action! The 5*5 Soccer Tournament kicks off on 27 October 2024. Don't miss out—register your team by 22 October 2024!&nbsp;Valuable prizes await the top 3 teams!For more information, check your emails.&nbsp; Oct 17 iSkills Closing Ceremony 17  October  2024 Egypt University of Informatics is organizing the closing ceremony for &nbsp;the iSkills professional Career Catalyst program, at its premises in the Knowledge City in the New Administrative Capital.&nbsp;The program was held in collaboration with Lancaster University and funded by the British Council, with the participation of experts from abroad. The program took place from August 18 to October 9. It aimed to enhance the university's role in nurturing promising talents among future leaders and supporting the telecommunications, information technology, and data sectors. The program targeted 45 students, empowering recent graduates with the skills, experience, and knowledge necessary for success in the job market, particularly business school graduates who completed their studies in 2023 or later and achieved a grade of \"Good\" or higher, as well as final-year students. Oct 09 ZoneED University Fair 9  October  2024 Don’t miss the chance to meet EUI’s team at the ZoneEd Universities Fair on October 9, 2024, from 4 pm to 8 pm at the Triumph Luxury Hotel, New Cairo, and take the first step toward a future full of possibilities! &nbsp;&nbsp; Sep 25 7th edition of the annual DevOpsDays Cairo Conference 25  September  2024 The seventh edition of the annual DevOpsDays Cairo Conference is taking place on September 25, under the patronage of the Ministry of Communications and Information Technology. The event is organized by the Software Engineering Competence Center (SECC) of the Information Technology Industry Development Agency (ITIDA), in partnership with Egypt University of Informatics (EUI) and leading industry players.Under the theme \"DevOps in the Era of Technology Evolution,\" the conference will explore the latest trends and innovations in DevOps through thought-provoking discussions and practical knowledge sharing.With world-class speakers from renowned organizations, attendees will gain valuable insights, network with industry peers, and examine the intersection of software development and IT infrastructure operations.&nbsp; Aug 26 EUI's Open Day 26  August  2024 Step into Your Future at EUI!Mark your calendars for August 26, 2024, from 11 AM to 3 PM for EUI’s next Open Day. This is your chance to delve into our state-of-the-art facilities, explore our diverse programs, and discover our wide range of scholarships and dual degree programs with top-ranked universities worldwide. You’ll also meet our faculty members, chat with current students, and tour our campus to see why EUI is where your future begins.Register now and enjoy free transportation on the day!Apply now on the website and start your journey with us today! Aug 18 iskills Career Catalyst Program 18  August  2024 In today’s competitive job market, graduates face significant challenges in securing suitable employment. To tackle these issues, Lancaster University UK, in collaboration with Egypt University of Informatics (EUI) and funded by the British Council, has developed the “iSkills: Career Catalyst Program”. This initiative aims to equip graduates with essential skills and practical experience in data analytics and sustainability.&nbsp;Enrolling in our program gives graduates a robust education and access to a pathway toward successful and fulfilling careers. They will have the necessary skills, experiences, and networks to thrive in today’s dynamic job market.&nbsp;Register here before 12 August 2024&nbsp;&nbsp;For more information, please check the Program Outline&nbsp;Don't miss the chance to meet the experts on campus!&nbsp;&nbsp;&nbsp;&nbsp; Aug 04 Edugate Fair 4  August  2024 Address Kempinski Royal Maxim Palace Hotel We are excited to announce that Egypt University of Informatics (EUI) will be participating in the prestigious EDUGATE Fair in Egypt from August 4th to 6th, 2024, at Kempinski Royal Maxim Palace Hotel in New Cairo. Visit our booth from 10:00 am to 8:00 pm to discover why EUI is an exceptional choice for your academic and professional journey. You can learn about our undergraduate programs in Communications and Information Technology, meet our Admission and Registration team to get answers to all your questions and explore our scholarship opportunities to support your academic journey. Additionally, hear firsthand from current students about their experiences at EUI, get a taste of our engaging student life, and learn about our dual degree agreements with top-ranked universities. With so many benefits waiting for you, don't miss this chance to take the first step towards achieving your goals.&nbsp;Register Here Apr 27 EUI’s first TEDx 27  April  2024 EUIans organized the first TEDx event, with the participation and attendance of successful figures from various fields and sectors, to discuss successful and inspiring experiences in various fields and issues surrounding diversity. Speakers exchanged their personal experiences in success and their perspectives that enabled them to achieve excellence, contributing to supporting talented students.The event included a variety of ideas in many fields to develop and evaluate EUIans’ thinking to keep up with the world's developments in various fields, including personal life and social relationships, by highlighting outstanding talents and giving them the opportunity to share their success stories with the students.Prof. Reem Bahgat, the president of Egypt University of Informatics, welcomed the organization of TEDx event, saying: \"We are delighted to organize this inspiring event for the students, as we believe in the importance and necessity of sharing experiences. We share the same goals and ideas with TEDx, which provides an opportunity for successful individuals to present what they have achieved along with the steps that enabled them to achieve it and how they overcame the obstacles they faced.\" She pointed out that solutions to future challenges often come from the ideas and minds of young people who have started their professional careers and have not adhered to traditional thinking, making them the leaders of the future.Prof. Bahgat added: \"This event allowed for the meeting of a distinguished group of speakers alongside promising students, all of whom share enthusiasm for learning, development, and innovation, in line with the new republic's interest in enhancing the spirit of creativity and excellence in various scientific and cultural fields among students, encouraging them to participate in initiatives that promote societal progress.\" She emphasized the existence of remarkable models of companies founded by youth that had the ability to make a difference in the world of technology.The first speaker, Dr. Mohamed Abdel Wahab, a lecturer at the Faculty of Computers and Artificial Intelligence at Cairo University, shed light on the challenge associated with continuous learning after graduation, which adds value and keeps one abreast of all the developments in the technology sector.In her speech, Eng. Nevien Magdy, the CEO and founder of Origin Technology Solutions, urged students to build strong networks, as this contributes to achieving rapid steps in record time, in addition to choosing career paths that match their capabilities and interests instead of following others. She said: \"Innovation and solutions do not come in isolation but through mutual cooperation and collective work across specialties, exchanging information and experiences.\"The famous YouTuber in the automotive field, Eng. Maged Al-Tawil, encouraged EUIans to stick to their dreams and work to achieve their goals no matter what difficulties and obstacles they face, as each of them can make a difference and shape their future in the way they see fit.The speakers emphasized the importance of unleashing ideas and innovations without putting limits on them, which contributes to finding sustainable solutions to problems and has a significant impact on bringing about a qualitative leap for societies, in addition to making their owners pioneers in entrepreneurship. Apr 18 DSC MENA 18  April  2024 H.E.Dr. Amr Talaat, the Minister of Communications and Information Technology, attended the closing of the Data Science and Artificial Intelligence (DSC) Conference in its first edition in Egypt and the Middle East and North Africa region. The conference was hosted by Egypt University of Informatics (EUI) in the Knowledge City in the New Administrative Capital with the participation of over 800 experts specializing in data science and artificial intelligence. The conference is considered one of the largest in the field of data science and artificial intelligence worldwide.The conference covered various specialized technological topics, including generative artificial intelligence, natural language processing and text analysis, computer vision and machine learning, deep learning, data-driven innovation, artificial intelligence and machine learning operations, data engineering, cloud data, AI applications in medicine, data product development, prompt engineering, open data and using data for public good, enhanced analytics in marketing, and end-to-end solutions.The conference, organized by Egypt University of Informatics in strategic partnership with the Information Technology Industry Development Agency (ITIDA), Ntervento company, and industry representatives including the main sponsor, Cyshield and the platinum sponsor, Huawei, took place from April 18th to 20th. The conference started online over two days and concluded its activities on the third day at EUI’s campus in the Knowledge City in the New Administrative Capital.In his speech, Dr. Talaat emphasized Egypt's vast wealth of data accumulated from various digitization systems operating in the country for decades. He highlighted the challenge of managing this data, including crucial concepts and aspects related to data privacy, data exchange regulation, data usage, and production. He pointed out the cooperation between the Ministry of Communications and Information Technology and various relevant entities in implementing the first phase of the national artificial intelligence strategy. He mentioned the establishment of the Applied Innovation Center to develop technological solutions using AI in sectors like healthcare and agriculture, highlighting Egypt's progress 50 steps in the global AI rankings.He also mentioned that the second phase of the national artificial intelligence strategy will focus on the importance of data science, its management, artificial intelligence, expanding the base of specialized experts, and launching awareness and training courses for citizens in these fields. He stressed the importance of collaborative work as an information society to keep pace with global developments in AI technology and address potential risks, especially with the emergence of generative AI systems. He also addressed concerns about AI potentially replacing humans in jobs. He announced that the conference marks the beginning of a series of international events and scientific dialogues that will be held in the Knowledge City in the New Administrative Capital on various topics related to communications and information technology.Prof. Reem Bahgat, President of Egypt University of Informatics, stated that the Data Science and Artificial Intelligence - Middle East and North Africa 24 (DSC MENA 24) conference aimed to unify efforts to provide a high-level event for the entire Middle East and North Africa region and the global AI community. This aligns with the increasing demand for extracting and reusing information from data, prompting companies to invest in building smart, efficient, and highly flexible systems. She emphasized the university's priority to host such conferences, bringing together researchers and specialized professionals to contribute to maximizing sustainable development in the New Republic.Eng. Alexander Link, founder of the Data Science Conference and CEO of DSC MENA 2024, expressed his delight at the great success of this edition of the conference, which has been held in most European countries in recent years. He confirmed that the conference will have regular extended activities in Egypt through fruitful cooperation with the Ministry of Communications and Information Technology, Egypt University of Informatics, and industry partners due to the promising opportunities in this vital sector in Egypt.Mr. Waleed Saad, Co-founder and CEO of Ntervento, emphasized the importance of the event in supporting the development of the technological sector in the region and promoting innovation and entrepreneurship. He highlighted the exceptional opportunity the conference provides to build strong relationships with a select group of experts and professionals in the field of data science and artificial intelligence worldwide. He added that hosting the first edition of the Data Science and Artificial Intelligence DSC MENA 2024 conference in Egypt represents a significant step in elevating its ambitions in the IT industry, reflecting its aspirations to lead the data and artificial intelligence revolution in the region.It is worth mentioning that Egypt University of Informatics is one of the first specialized universities in the Middle East and Africa in the fields of communications, information technology, and related fields. It was established by the Ministry of Communications and Information Technology in collaboration with the Ministry of Higher Education and Scientific Research to become a leading academic institution offering specialized educational programs to meet the labor market's need for professionals in the latest fields of information and communication technology. The university includes four faculties: Computer and Information Sciences, Engineering, Business Technology, and Digital Arts and Design, offering 16 specialized educational programs in areas such as artificial intelligence, data science, electronics and communications engineering, business analysis, digital marketing, animation, user experience, and game design.Dr. Amr Talaat also visited the exhibition held on the sidelines of the conference, which included several companies showcasing the latest products and services developed using artificial intelligence and data science.The closing ceremony of the conference was attended by Prof. Reem Bahgat, President of Egypt University of informatics, Prof. Ahmed Hassan, Vice President for Academic Affairs, Prof. Amr El-Masry Dean of Faculty of Engineering, Prof. Hoda Mokhtar, Dean of Faculty of Computing and information Sciences, Dr. Amani Eissa, Head of Business Development, Prof. Iman Saroit Chairman of the ICT sector at the Supreme Council of Universities, Prof. Ahmed Khattab, Director of the National Telecommunications Institute (NTI), Dr. Abdel Moneim El-Sharqawi, President of the National Academy for People with Disabilities (NAID), Prof. Haitham Hamza, Acting President of the Software Engineering Competence Center (SECC), and several leaders from the Ministry of Communications and Information Technology, as well as a selection of specialists in the fields of data and artificial intelligence Sep 12 Metaverse for Startups Competiton 12  September  2023 Egypt University of Informatics (EUI) has launched the “Metaverse for Startups” competition under the slogan “Extended Reality for the Public Good” as part of the “Workshop on Metaverse and Artificial Intelligence,” with the collaboration and support of Ministry of Communications and Information Technology, Meta, the American University in Cairo, Simplon, and Meta Academy. The competition aims to showcase and support startups that use metaverse technology and solutions in various industries that align with sustainable development goals.The university hosted ten selected startups out of 17 applicants who applied for the competition. It introduced them to a jury of experts from Meta, EUI, AUC Venture Lab, and Significa Ventures, as well as the valuable contribution of Dr. Abdel Monem El-Sharkawy, Chair of the National Academy for Information Technology for Persons with Disabilities (NAID). The jury evaluated the startups based on their innovation, impact, scalability, and sustainability.The “Workshop on Metaverse and Artificial Intelligence” also kicked off with the participation of a group of international and local experts, representatives of the government and private sectors, the academic community, and Egyptian startups. The workshop aims to raise awareness about modern digital technologies' importance in driving the economy, supporting digital transformation efforts, enhancing innovation, and building youth capabilities. The workshop took place from 12-14 September.The Ministry of Communications and Information Technology cooperated and participated in the workshop activities as part of its keenness to keep pace with global trends towards developing emerging technologies and their uses, such as artificial intelligence and metaverse technologies. The ministry also seeks to build a base of distinguished cadres capable of competing in the international labor market and building effective partnerships with industry in this field.The workshop covered several topics related to the nature of metaverse technology, the economic opportunities offered by emerging technologies and their success factors, as well as the regulatory frameworks required to ensure the safe and beneficial use of these technologies, ways to manage businesses, and provide services, and how to preserve identity and personal data.The workshop, held over three days, included several sessions to exchange experiences and knowledge about the policies and regulatory frameworks required for the metaverse in various fields, such as education, heritage, tourism, empowering people with special needs, music, and digital transformation.The opening ceremony was attended by H.E. Dr. Reda Hegazy, Minister of Education; Eng. Ghada Labib, Deputy Minister of Communications and Information Technology for Institutional Development; Mr. Kojo Boayke, Vice President for Africa; the Middle East and Turkey for Public Policy at Meta; Prof. Reem Bahgat, President of EUI. Prof. Ahmed Dallal, President of the American University in Cairo, was also keen to record his words for the opening.The workshop included several sessions that discussed the economic, technical, political, and regulatory aspects of metaverse and AI and the best practices for building and deploying next-generation technology. The speakers included Prof. Reem Bahgat, President of EUI; Dr. Hossam Othman, advisor to the Minister of Communications and Information Technology for technology innovation, electronics industry, and training; Dr. Ahmed Tantawi, Head of the Applied Innovation Center (AIC), Dr. Abdel Moneim El-Sharkawy, Chair of the National Academy for Information Technology for Persons with Disabilities, Dr. Amani Issa, Head of Business Development at EUI, Eng. Suzan Al-Aqabawi, Advisor to the Minister for Data Governance, Eng. Ahmed Saeed, Advisor to the Minister for Economic and Statistical Affairs, and Mr. Kojo Boayke, Vice President for Africa; the Middle East and Turkey for Public Policy at Meta.Mr. Kojo Boayke highlighted that Meta and other companies plan to co-create the metaverse, a shared virtual environment where people can interact with each other and digital content. He said that more than 3.8 billion people use Meta platforms every month and that Meta established the Metaverse Academy to accelerate the development of Metaverse technology and shape the ecosystem. He also stressed that safety and integrity are at the core of the development process.Prof. Reem Bahgat confirmed that EUI is one of the first universities specialized in communications and digital technologies and the fields affected by them. She said that the university offers specialized programs for education to meet the labor market’s need for specialists in the latest fields of information and communications technology. She also announced that EUI hosted ten finalists for the first round of the “XR for Good Metaverse Startup 2023 Competition” on campus and that the winning startup will receive a prize of $10,000.In his recorded message, Prof. Ahmed Dalal expressed his pleasure at participating in this event, stressing that AUC pays excellent attention to metaverse technologies. He said that they represent a radical shift in the way companies and individuals interact with each other while providing a new opportunity. Aug 24 IEEE North Africa Students and Young Professionals Congress 24  August  2023 Egypt University of Informatics concluded the agenda of the North Africa Students and Young Professionals Congress (NASYP 2023), in cooperation with the Institute of Electrical and Electronics Engineers (IEEE), which was hosted by EUI over four days on campus in the Knowledge City at the New Administrative Capital, under the patronage of H.E.Dr. Amr Talaat, Minister of Communications and Information Technology, H.E.Prof. Ayman Ashour, Minister of Higher Education and Scientific Research, with a wide presence of engineers, academics, researchers, and students, from North African countries as well as international speakers.North Africa Students and Young Professionals Congress took place this year under the theme \"Engineering technology, and its role in serving humanity and cooperation between universities and industry partners to achieve sustainable development goals and build the voluntary capacity building for the young generation,”&nbsp;with the support and sponsorship of Egypt Post, Valeo, and Dell Technologies.&nbsp;In his speech, which was addressed to the audience by Eng. Ghada Labib, Deputy Minister of Communications and Information Technology for Institutional Development, on his behalf, &nbsp;H.E. Dr. Amr Talaat, Minister of Communications and Information Technology, sent his gratitude to the young students and professionals who participated in this congress, saying: \"You are the future of our region, and I am confident that you will use your skills and knowledge to make a positive impact and create a more inclusive and equitable world. I have looked at the headlines of the sessions and concluded some keywords describing this congress as\" technology, humanity, sustainability, and the future, which is a critical topic as we face several challenges, such as climate change, poverty, and inequality. It goes without saying that technology can play a crucial role in meeting these challenges, and I am confident that tomorrow's solutions will be developed by young people in this Hall”.&nbsp;In his statement, the Minister of Communications added, \"I thank IEEE volunteers in general and both Egypt University of Informatics and the IEEE Egypt section in particular for organizing this event, which is an essential opportunity for students and young professionals from North Africa to meet, learn from each other, share ideas and build relationships. This event was enriched by many international speakers from Region 8 (Europe, the Middle East, and Africa) and a global level. \"&nbsp;The Minister continued, \"In this context, which is entirely in line with the congress, the Ministry of Communications and Information Technology supports many specific projects and initiatives to build technology and innovation leaders, for example, the National Academy of Information Technology for Persons with Disabilities, Information Technology Institute, National Telecommunications Institute, Digital Egypt Initiative, and many others. The Minister of Communications urged the students: \"I would like to encourage you to continue learning and growing, using your skills and knowledge to make a difference in the world, and I am confident that you will positively impact our region and beyond.&nbsp;Moreover, H.E. Prof. Aiman Ashour, Minister of Higher Education and Scientific Research, thanked Egypt University of Informatics for hosting the congress and the IEEE Egypt section for successfully organizing this important event.&nbsp;Prof. Sherif Kishk, Assistant Minister of Higher Education and Scientific Research for Digital Transformation, gave the minister’s speech on his behalf: \"I am particularly pleased to see so many young people from across the region here today. You are the future of engineering and technology, and I am confident you will achieve great things in academia and industry. I urge you to be those heroic engineers and technicians who solve the world's problems, not those who create them.&nbsp;The Minister of Higher Education and Scientific Research added: \"This congress has been an excellent opportunity for you to learn from each other, share ideas, and connect with your industry professionals, and I hope you have taken full advantage of this opportunity and I also hope to be able to see further international research cooperation from many countries in the near future. He also praised the Congress agenda, which focused on humanitarian activities and social responsibility, an essential aspect of the State.This came in the presence of Prof. Ahmed Darwish, Honorary President of IEEE Egypt Section and former Minister of State for Administrative Development, and many researchers, academics, and engineers from various countries across Europe, Africa, and the Middle East, who were keen to participate in the current edition of this important congress. The list of IEEE Professionals and experts included Prof. Saifur Rahman, IEEE President and CEO and the Founding Director of the Advanced Research Institute, Virginia Tech, Prof. Mike Hinchey, Director-Elect of IEEE Region 8 and former Director of the NASA Software Engineering Laboratory and Eng: Abdullateef Aliyu, Chair of the IEEE Region 8 Student Activities Committee.&nbsp;Prof. Reem Bahgat, President of Egypt University of Informatics, emphasized that the congress was aimed at consolidating the culture of innovation and developing solutions for future challenges in the technological and industrial sector, in line with the EUI’s agenda and the new directions of the Egyptian government. The congress served as a platform for experts, academics specializing in engineering and computing sciences, and students from different countries to discuss the latest research and technical developments of interest to industrial, technological, and academic communities.&nbsp;Prof. Ahmed Hassan, EUI’s Vice President for Academic Affairs, explained that to make greater use of the benefits, the IEEE industry relations committee members, representing all countries of the Middle East and North Africa, met on the sidelines of the Congress as well as the National Committee for Information and Communication Technology of the Egyptian Academy of Scientific Research. Dec 02 Welcome Party 2  December  2022 The singer Mahmoud El Esseily performed live at the knowledge city at the New Administrative Capital last Friday night at EUI, which held a concert to welcome new students for the academic year 2022-2023. The great singer expressed his pleasure at being on campus and welcomed the crowd.El Esseily commenced the concert with many famous songs with great interactive vibes from the audience on his tune for a full hour. Disco Misr and DJ El-Waili followed El Esseily to excite the audience of different ages with beats and energetic remixes.EUI celebrated its students and the new batch of students in the current academic year, with the attendance of Prof. Reem Bahgat, President of the university, the deans of different faculties, Dr. Amani Hassan, Head of Business Development, Dr. Yasser Kazem, Secretary General of the university, faculty members, associates, as well as the heavy attendance of students and their families.Prof. Reem Bahgat, President of the University, thanked EUI's team for organizing the ceremony and contributing to its great appearance. According to international design and lighting specifications, the stage was built at the Roman theatre at the Knowledge City.The university's president, faculty deans, and faculty members took photos with students during the concert. Different security forces have extensively worked on ensuring its security. Aug 28 Climate Change Hackathon (Climathon) 28  August  2022 Under the auspices of the Ministry of Communications and Information Technology and the Ministry of Higher Education and Scientific Research, and with the honoring presence of Dr. Amr Talaat, Minister of Communications and Information Technology, Egypt Informatics University (EUI) concluded Climathon2022, which began on 28 August, to devise technical solutions and produce prototypes of creative ideas, to reduce the risks and negative impacts of climate change on the planet through the use of information technology. Climathon 2022 was held as part of Egypt’s hosting of the 27th session of the Conference “COP 27” in Sharm el-Sheikh from 6 to 18 November 2022 under the auspices of President Abdel Fattah el-Sisi.The university was honored to welcome a group of esteemed officials from the Ministry of Communications and Information Technology, headed by Eng. Ghada Labib, Deputy Minister of Communications for Institutional Development, Dr . Iman Ashour, Director of the National Telecommunications Institute, Eng.Mohamed Nasr, Deputy Minister for International Informatics. Dr. Abdelmoneim Al Sharkawy, President of the National Academy of Information Technology for Persons with Disabilities, Mrs. Samah Aziz,Director of the Central Department of International Relations, Eng. Ahmed Hussein, Head of the Public Administration for implementing Engineering Projects for the Central Department.Several leaders from the entities of the Ministry of Higher Education and Scientific Research and Universities also attended, including Prof. Mahmoud Saqr, President of the Academy of Scientific Research, Prof.Walaa Sheta, Chief Executive Officer for the Science, Technology, and Innovation Funding Authority, Prof. Moawad Al-Khouli, President of New Mansoura University, Prof. Ashraf Haider Ghaleb, President, MisrUniversity of Science and Technology, Prof. Hesham Farouk, Deputy Minister of Higher Education and Scientific Research for Digital Transformation and Prof.Mohamed Ahmed Amer, Executive Director, Innovators Support Fund, as well as deansof various faculties to which the participating teams are enrolled.Representatives of the embassies of the participating teams, H.E. Ambassador Datakarran Gobourdhun, Ambassador Mauritius in Cairo, Mr. Nikansthing Jagarnath,Adviser to the Embassy of Mauritius in Cairo. Mr.&nbsp; Abdullah Yusuf Al-Harahshah, Jordanian Cultural Attache in Egypt, also participated. Esteemed members of the Board of Trustees of Egypt University of Informatics attended, on the top which was Prof. Sherif Hammad, former Minister of Scientific Research and Professor of Computer and Systems Engineering, journalist Karam Gabr, Chairman of the Supreme Council for Media Regulation, Prof. Saeed Megahed, Professor of Robot, Dynamics and Control at the faculty of Engineering, Cairo University, and Dr. Mohamed Hammadi, Former Chief Technology Officer at Sky Group, Europe’s leading media andentertainment company.Eng. Hossam Megahed, Chief Executive Officer of Etisal Company, also was present at the event. Representatives of the hackathon sponsors, headed by Dr. Abdou Alwan, Vice-Chairman of Egypt Post, Mr. Herve JM. Marchet, Education Lead, Africa and the Middle East, Amazon Web Services, and Eng. Nour Al-Din Zaki, Regional Director of Intel Egypt.The activities of Climathon2022, headed by Dr. Amani Eissa, took place over more than a month under the auspices of the Ministry of Communications and Information Technology, and the Ministry of Higher Education and Scientific Research, in cooperation with Amazon Web Services AWS, where the awards worth 1 millionpounds in addition to many other prizes were offered by the sponsors of the Climathon2022; Egypt Post, Intel, and ITIDA.The competition, in which more than 1500 students representing 50 Egyptian, Arab, and African universities from 33 countries participated in 4 themes of climate change (Sustainable Cities, Communities Empowerment, Clean Energy, and Water Stewardship), also featured an Egyptian startup competition on climate change and sustainable development. In addition, the projects involved went through three evaluation stages, the last of which was on Thursday, 29 September 2022. H.E, Dr. Amr Talaat, Minister of Communications and Information Technology, stressed that EUI was born large, with its science, activities, and its members.The participation of this number of Arab and African countries in this hackathon illustrates the university’s standing and academic importance. Talaat congratulated all the teams participating in the competition: “I congratulate the winners in this competition; however, everyone who participated in it is a winner.”The Minister of Communications and Information Technology explained that this hackathon sends critical messages of research and innovation and the need to meet the challenges facing our societies, so the Ministry is working to create technology solutions for communities and nations while addressing climate change, preserving the environment and creating solutions is the following message. Talaat noted that Egypt’shosting of the climate summit confirmed the State’s interest in the issue.Talaat said, “The Ministry of Communications and Information Technology is interdependent in all sectors of the country, directing all the Ministry’s capabilities to create a better and clean environment in all activities. We are currently using fibers to reduce thermal emissions, in addition to working with mobile companies to reduce environmental pollution, and the same thing we do with the Ministry of Environment.Civil society had a responsibility to meet that enormous challenge.Dr. Reem Bahgat, President of the Egyptian University of Informatics, confirmed that the university is always keen to stay aligned with the age of digital development.Therefore, EUI organized the Climate Change Hackathon Competition to serve as a platform for practical solutions to this crisis and to address it by harnessing technology science to stop its repercussions. Bahgat explained that the competition relied on students’ innovations to advance the field of climate improvement in Egypt and the world, which makes EUI keen to help them develop these ideas into concrete reality and present them at the World Climate Summit in Egypt next November.Dr. Amani Eissa, President of the Organizing Committee for Hackathon and Head of Business Development at EUI, praised the Ministry of Communications and Information Technology for its vital role in supporting innovations, research projects, and practical competitions to improve the quality of life under the Fourth Industrial Revolution.Dr. Amani Eissa explained that the organization of Climathon 2022 came from the pivotal role of EUI as an educational and research institution adopting innovative initiatives. She noted that all participants are talented and passionate about learning as leaders capable of bringing about change and growth in Egypt’s technology sector while tackling climate change with their innovations.Mr.Herve JM Marchet, Education Lead, Middle East and Africa at Amazon Web Services, confirmed that there are real solutions to tackle this phenomenon by adapting technology in this direction.The Scarab team of students of the Faculty of Engineering at the University of October for Modern Sciences and Arts won first place in the “Water Stewardship” theme. They created a prototype for the unit of water generation from the air; Access Denied team of Polytechnics Mauritius University students won second place by providing an innovative solution to solve the water crisis by reusing water resources again, such asrainwater.The third place went to the Water Cache team of students of the Princess Somaya University of Technology in Jordan, who created a water management and consumption forecasting system to reduce the loss of good water.In the “Clean Energy” theme, ASC from students of Misr University of Science and Technology won first place with a solution to address environmental waste to preserve the environment and deal with the challenges of climate change through the development of A.I., IoT, data science, and biotechnology technologies. The second place was won by the Earthians team of students of Mansoura University, who devised a solution to invest in roads to produce clean energy by creating a smart road and using solar energy in street lighting and smart pedals. MUSTIANS team of Misr University of Science and Technology students won third place and devised a solution to preserve the environment and deal with the challenges of climate change by transforming existing buildings into eco-friendly buildings.In the “Sustainable Cities” theme, the Go Green team of students from the Princess Somaya University of Technology, Jordan, won first place with their “Save the Blue” project aimed at reducing the waste of usable water. ZRMS team of New Mansoura University students won second place; they focused on using solar energy for electricity production, turning ordinary road networks into eco-friendly smart road networksbased on a clean energy source. Third place went to the Oxidizers team of Zagazig University students, who created a shared transportation system that serves new sustainable cities using machine learning and artificial intelligence.In the “Communities Empowerment” theme, the Together team of Zagaziq University students won first place and created a mobile app to help raise awareness and understand the minor human impacts of climate change. The second place was won by the Egypt Sustainable Minds team of students from October University for Modern Sciences and Arts and Egypt University of Informatics, who created the project“Integrated Air Quality System” to reduce heat warming emissions and increase awareness of the importance of carbon footprint calculation and help reduce carbon emission by changing lifestyles. The Elite team of Zagaziq University students, who have devised a consumer application to follow bills and control consumption, won third place.Sun Pave won the best startup. SUNPave is an innovative UK-patented solar panel technology that matches traditional tilted P.V. panels’ energy yield with single-axis tracking.", "length": 9330}
{"url": "https://eui.edu.eg/news", "chunk_index": 0, "text": "Skip to main content News Image News 21  August  2025 Prof. Youssri Hassan Appointed Editor at Frontiers in Applied Mathematics and Statistics 14  August  2025 EOCS 2025: Egypt’s Brightest Minds Compete at EUI 9  August  2025 MAIN Segment 2025 Ignites Innovation at EUI", "length": 43}
{"url": "https://eui.edu.eg/newsletters", "chunk_index": 0, "text": "Skip to main content Newsletters Image Newsletters Image December 2024 12  December  2024 Issue Number 1 Issue#1 Image May 2025 25  May  2025 Issue Number 10 Download PDF Image February 2025 26  February  2025 Issue Number 9 Download PDF Image November 2024 30  November  2024 Issue Number 8 Download PDF Image August 2024 20  August  2024 Issue Number 7 Download PDF Image May 2024 20  May  2024 Issue Number 6 Download PDF Image February 2024 20  February  2024 Issue Number 5 Download PDF Image November 2023 20  November  2023 Issue Number 4 Download PDF Image August 2023 20  August  2023 Issue Number 3 Download PDF Image May 2023 20  May  2023 Issue Number 2 Download PDF", "length": 116}
{"url": "https://eui.edu.eg/media-gallery", "chunk_index": 0, "text": "Skip to main content Media Gallery Image Media Gallery Main Segment 2025 9  August  2025 Images prev next Top Thanaweya Amma Achievers 31  July  2025 Images prev next Ctrl+Z Heritage Exhibition 21  July  2025 Images prev next LAND A JOB OFFER IN JAPAN! – FAST OFFER 21  July  2025 Images prev next BI Graduation Projects Discussions - Digital Marketing & E-commerce 1  July  2025 Images prev next Albums by Year: 2024 2023 2022", "length": 73}
{"url": "https://eui.edu.eg/media-coverage-0", "chunk_index": 0, "text": "Skip to main content Media Coverage Media Coverage Image Issue 1 (December 2024) Issue 2 (January 2025) Issue 3 (February 2025) Issue 4 (March 2025) Issue 5 (April 2025) Issue 6 (May 2025) Issue 7 (June 2025) Issue 8 (July 2025) Issue 9 (August 2025)", "length": 45}
{"url": "https://eui.edu.eg/research", "chunk_index": 0, "text": "Skip to main content Research Image Research Researching Today & Revolutionizing Tomorrow. SML-AutoML: A Smart Meta-Learning Automated Machine Learning Framework Read More An Efficient Petrov–Galerkin Scheme for the Euler–Bernoulli Beam Equation via Second-Kind Chebyshev Polynomials Read More Recursive and Explicit Formulas for Expansion and Connection Coefficients in Series of Classical Orthogonal Polynomial Products Read More Characterizing a Generator Polynomial Matrix for the Dual of a Multi-Twisted Code Read More Efficacy of Virtual Reality Distraction for Reducing Chronic Pain Read More Tau Algorithm for Fractional Delay Differential Equations Utilizing Seventh-Kind Chebyshev Polynomials Read More Chemical, biological, radiological and nuclear event detection and classification using ontology interrogation and social media data. Read More Towards online training for RL-based query optimizer Read More Deepfake Detection: Enhancing Performance with Spatiotemporal Texture and Deep Learning Feature Fusion Read More Advanced Digital Twins for Smart Manufacturing Networks: A Manufacturing -as-a-Service Paradigm” Read More", "length": 147}
{"url": "https://eui.edu.eg/projects", "chunk_index": 0, "text": "Skip to main content Projects Reference site about Lorem Ipsum, giving information on its origins, as well as a random Lipsum generator. Under Construction", "length": 24}
{"url": "https://eui.edu.eg/join-euis-team", "chunk_index": 0, "text": "Skip to main content Join EUI's Team! Image Join EUI's Team! Building a talented and dedicated team of professionals We're committed to building a talented and dedicated team of professionals who share our passion for innovation and excellence. Our goal is to attract and retain the best minds in the field, who will help drive our mission to transform the world through education and technology. At EUI, we believe in transparency and fairness in our hiring process. That's why we post all job openings on our website, including a brief job summary and a list of required and preferred qualifications. Whether you're looking for an academic teaching position or a full-time or part-time staff role, you can find your perfect fit here. Gray background Student Life Supervisor Full-Time Student Life Department 20  August  2025 Join Now Faculty Member - Part-Time Digital Marketing and E-Commerce Program Faculty of Business Informatics 20  August  2025 Join Now Teaching Assistant/ Assistant Lecturer Teaching Assistant/Assistant Lecturer—Full Time—Faculty of Business Informatics Finance 22  July  2025 Join Now Faculty Members Faculty Members—Part Time—Faculty of Digital Arts and Design Digital and 3D Animation & Digital Interior Design 8  July  2025 Join Now Faculty Member Faculty Member-Part-time – Faculty of Business Informatics Leadership and Organizational Behavior / Finance Theory and Portfolio Management. 25  June  2025 Join Now Lab Engineer Lab Engineer—FT—Faculty of Engineering 18  June  2025 Join Now Faculty Adminstrative Assistant Full-Time Join Now Assistant/Associate Professor Faculty Member “Full-Time/Part-Time” – Faculty of Engineering 18  June  2025 Join Now Teaching Assistants/Assistant Lecturers Teaching Assistants/Assistant Lecturers—Full-Time—Faculty of Engineering 18  June  2025 Join Now ESL/EFL Instructor ESL/EFL  Instructor—Full  Time—English Department 4  June  2025 Join Now Assistant Professor & Associate Professor Assistant Professor & Associate Professor—FT—Faculty of Computing and Information Sciences 23  March  2025 Join Now Incubation Supervisor Incubation Supervisor- Full-Time-  Entrepreneurship and Innovation Center 22  January  2025 Join Now", "length": 307}
{"url": "https://eui.edu.eg/faqs", "chunk_index": 0, "text": "Skip to main content Frequently Asked Questions What is Egypt University of Informatics (EUI)? Egypt University of Informatics (EUI) stands as one of the pioneering specialized institutions in the Middle East and Africa dedicated to Communications, Information Technology, and their associated domains. Established through collaboration between the Ministry of Communications and Information Technology and the Ministry of Higher Education and Scientific Research, EUI is committed to being a premier academic center delivering tailored educational programs to fulfill the demands of the job market with proficient ICT professionals. What faculties are offered by EUI? EUI offers the following faculties: Computing and Information Sciences Engineering Business Informatics Digital Arts and Design Does EUI comply with the Ministry of Higher Education’s rules and regulations? Yes, EUI adheres to the rules and regulations set forth by the Ministry of Higher Education. Are housing/accommodation services offered? EUI provides high-standard dormitories for students residing outside Cairo and Giza governorates. Students from Cairo and Giza interested in dormitory accommodation should contact the facilities manager. Are there additional exams besides the English Placement Test? For the Faculty of Digital Arts and Design, there is an aptitude test to assess the student’s proficiency. Are transportation services available? Regular transportation services connect EUI to significant locations in Cairo and Giza. Can IELTS or TOEFL substitute for the English Placement Test? Yes, only for an IELTS score  5.5 or above, or a TOEFL score 65 or above (both equivalent to B2 level) Can IGCSE students apply after Grade 11? Yes, IGCSE students can apply after Grade 11 with an official letter from the Ministry of Higher Education and Scientific Research. Can students transfer to a foreign university campus abroad? Subject to meeting the foreign university's requirements, students can transfer to its campus during their senior year and receive the native degree of the foreign university. Does the university accept STEM and Nile School students? Yes, both STEM and Nile School students are eligible to apply for admission to the University. How many semesters are available in the Academic year? There are three academic semesters: Fall, Spring, and an optional Summer semester. Is the university affiliated with different syndicates? Currently, EUI is not registered with any syndicate. Registration in various syndicates is contingent upon the graduation of the first batch. What are the types of scholarships offered to students? EUI offers full scholarships for top Thanaweya Amma students, as well as partial scholarships based on academic merit and other athletic scholarships. For more information, please visit the Scholarships page What currency are EUI's tuition fees in? Egyptian students pay tuition fees in EGP, while non-Egyptian students pay in USD at the EUI campus. What high school certificates does EUI accept? EUI accepts national and international certificates, including Thanaweya Amma, Abitur, IGCSE, GCSE, American Diploma, Thanawya from Arab countries, International Baccalaureate, Canadian Certificate, Fachoberschule FOS, and French Baccalaureate. Which entities provide academic scholarships for students? Entities such as Microsoft, Sawiris Foundation for Social Development, Banque Misr, and Dell Company cover scholarships for students. Will the university introduce faculties unrelated to the IT field? EUI currently offers faculties related to Communications, Information Technology, and their associated fields. Will tuition fees remain the same for applicable dual degree agreements? Students are required to pay EUI fees throughout their study years on campus. Additional fees for online/blended courses offered by the foreign university will apply. During the year spent abroad, students will pay international tuition fees to the foreign university, with administrative fees payable to EUI. Is EUI recognized globally? EUI has recently been ranked among the top universities in the Times Higher Education Impact Rankings for 2024, an impressive achievement just two years after commencing our educational programs. This ranking includes 2,152 universities from 125 countries and regions. EUI has excelled in several areas related to the United Nations Sustainable Development Goals, including: Decent Work and Economic Growth (ranked 601-800) Gender Equality (ranked 601-800) Reducing Inequality (ranked 801-1000) Good Health and Well-being (ranked 1001+) Quality Education (ranked 1501+) Partnerships for the Goals (ranked 1501+) Which faculties offer dual degrees with partner universities? Faculty of Engineering Faculty of Computing and Information Sciences Faculty of Business Informatics", "length": 690}
{"url": "https://eui.edu.eg/contact-us", "chunk_index": 0, "text": "Skip to main content Contact Us We're here to help! Contact us for any inquiries. New Administrative Capital, Knowledge City. [email protected] 15702 Admission Phone1 : 01030080940 Admission Phone2 : 01030090509", "length": 31}
{"url": "https://eui.edu.eg/news/prof-youssri-hassan-appointed-editor-frontiers-applied-mathematics-and-statistics", "chunk_index": 0, "text": "Skip to main content 21st August, 2025 Prof. Youssri Hassan Appointed Editor at Frontiers in Applied Mathematics and Statistics Image Prof. Youssri Hassan, Professor of Mathematics at the Faculty of Engineering, has been selected to serve as Editor for Frontiers in Applied Mathematics and Statistics (Section: Mathematics of Computation and Data Science ). With an Impact Factor of 1.5 and a Scopus CiteScore of 2.8 , the journal is recognized internationally for advancing high-quality research in the field. Prof. Hassan’s editorial profile can be viewed here: Editorial Profile – Frontier", "length": 90}
{"url": "https://eui.edu.eg/news/eocs-2025-egypts-brightest-minds-compete-eui", "chunk_index": 0, "text": "Skip to main content 14th August, 2025 EOCS 2025: Egypt’s Brightest Minds Compete at EUI Image The final round of the EgyptIan Olympiad in Computational Science (EOCS) 2025 took place on 14 August at  Egypt University of Informatics (EUI) in the New Administrative Capital, marking the highlight of the competition. Twelve finalist teams, made up of thirty-five students, advanced to this stage, with the majority being high school students from Egypt’s STEM schools, particularly the STEM High School for Boys—6th of October, alongside a smaller group of undergraduates. Their strong participation reflected the vital role of STEM schools in nurturing scientific talent and preparing young people to meet advanced interdisciplinary challenges. The finalists competed in a three-hour problem-solving session covering physics, chemistry, biology, and mathematics, all approached through computational methods. Working collaboratively under time pressure in EUI’s modern labs, students demonstrated creativity, technical skills, and resilience. The day opened with a welcoming ceremony and an inspiring address from Dr. Mohamed Ismail, who emphasized the importance of computational sciences for Egypt’s future. EOCS 2025 was Egypt’s first national-level competition dedicated to computational science, spanning physics, chemistry, biology, and mathematics. Its aim was to inspire the next generation of problem-solvers and create stronger links between theoretical knowledge and real-world applications. The competition journey began in June 2025 with the online qualification phase, which saw more than 780 students register from schools and universities across Egypt. Out of these, 165 advanced to the training phase, which ran from June to July and provided participants with online sessions in computational methods, programming, and interdisciplinary problem-solving. These sessions attracted 40–50 students on average, equipping them with the foundations needed for later stages. In July, the online qualifying round was held to identify the most skilled participants based on accuracy, creativity, and teamwork, ultimately determining the twelve finalist teams that advanced to the concluding event at EUI. The success of EOCS 2025 was the result of collaboration among several partners. EUI served as the official host of the final round, providing an inspiring venue and technical facilities that enhanced the participants’ experience. Members of the IEEE EUI Student Branch contributed significantly by supporting the event’s logistics and ensuring smooth coordination on the ground. The STEM High School for Boys – 6th of October played a special role in encouraging participation and preparing its students, who formed a strong share of the finalists. Together, these contributions demonstrated the value of cooperation between schools, universities, and professional organizations in building an ecosystem that supports innovation in computational science. Recognition was an important part of the celebration. The top three teams received monetary awards of 3,000 EGP for the gold team, 2,000 EGP for silver, and 1,000 EGP for bronze. Certificates of Excellence were presented to the best-performing teams in each scientific field, while all participants received Certificates of Participation, handed personally by Dr. Mohamed Ismail. Media Gallery: prev next", "length": 481}
{"url": "https://eui.edu.eg/news/main-segment-2025-ignites-innovation-eui", "chunk_index": 0, "text": "Skip to main content 9th August, 2025 MAIN Segment 2025 Ignites Innovation at EUI Image EUI’s campus transformed into a dynamic hub of innovation, as ASME Cairo University, GDG EUI, and EUI joined forces to bring their flagship multidisciplinary event to life EUI . The day was charged with energy and expertise. Attendees benefited from inspiring panels led by industry visionaries; hands-on workshops exploring Industry 4.0, CFD, BIM, HVAC, and beyond; and a career fair that connected emerging talent with leading engineering and tech companies. Complementing this were mentorship circles, including CV reviews and mock interviews, alongside networking opportunities that opened real doors for the future EUI . MAIN Segment 2025 proved to be more than just an event — it served as a powerful catalyst for innovation, blending mechanical engineering, data science, and AI into a high-energy day of ideas, skills, and connections that are set to drive the next wave of engineering breakthroughs. Media Gallery: prev next", "length": 159}
{"url": "https://eui.edu.eg/news/euis-finbud-team-reaches-top-10-cbe-fintech-got-talent-competition", "chunk_index": 0, "text": "Skip to main content 4th August, 2025 EUI’s FinBud Team Reaches Top 10 in CBE FinTech Got Talent Competition Image FinBud, led by Omar Shafie and supported by teammates Omar Sharaf, Omar Hesham, and Shady Adham from the Faculty of Computing & Information Sciences, has secured a spot among the top 10 finalists in the prestigious CBE FinTech Got Talent Competition . After competing against 30 of Egypt’s top university teams, FinBud impressed the judges with its innovative ideas and technical expertise, earning a place in the highly competitive finals set for September 2025. Congratulations to the FinBud team.We look forward to seeing your creativity and innovation shine on the finals stage!", "length": 112}
{"url": "https://eui.edu.eg/news/three-euians-first-place-regional-wameed-short-film", "chunk_index": 0, "text": "Skip to main content 4th August, 2025 Three EUIans Win First Place in Regional “Wameed” Short Film Competition with Grandmatales Image We are proud to announce that three exceptional students from the Faculty of Digital Arts and Design at Egypt University of Informatics (EUI) have won first place in the prestigious Wameed Short Film Competition for their short film titled “Grandmatales.” The Wameed competition, organized by the IEEE Women in Engineering (WIE) Affinity Group at ISSATM, is a regional initiative that brings together young creatives and engineers from Tunisia, Jordan, and Egypt. The event aims to promote storytelling, cultural identity, and gender inclusivity through short films that reflect personal experiences, local traditions, and real-world issues. The winning team from EUI stood out among dozens of participants in both the national and regional rounds. Their short film, Grandmatales , captivated the jury with its originality, emotional impact, and technical execution. Blending culture, creativity, and narrative strength, the film highlighted the rich storytelling tradition passed down through generations, seen through the eyes of youth. The competition involved multiple phases, starting with a national selection where the top teams from each country qualified for the regional finals. The EUI team successfully progressed to the final round, where they competed against the best entries from across the MENA region and emerged victorious. As part of the competition, all participants underwent mandatory training sessions that enhanced their filmmaking skills and provided opportunities for cross-border collaboration and creative exchange. The EUI team’s commitment, artistic vision, and dedication were evident throughout the process, earning them well-deserved recognition on the regional stage. This win reflects the university’s ongoing support for interdisciplinary creativity and the integration of technology with the arts. It also showcases EUI’s dedication to empowering students to express their voices and engage with wider regional platforms. Congratulations to our talented EUIans for this remarkable achievement. We look forward to seeing more of their creative work in the future!", "length": 322}
{"url": "https://eui.edu.eg/news/mcit-launches-digitopia-competition-support-innovation-and-discover-talented-youth", "chunk_index": 0, "text": "Skip to main content 2nd August, 2025 MCIT launches the Digitopia competition to support innovation and discover talented youth. Image The Ministry of Communications and Information Technology (MCIT) has launched the annual \"Digitopia\" competition , aimed at discovering and supporting innovative ideas and outstanding projects that contribute to the development of the ICT sector and promote the use of technology in community development. The competition encourages creativity among children and youth — from 4th grade up to the age of 35 — to develop innovative technological solutions addressing societal challenges. The first edition of the competition will run during Summer 2025, from August 1st until mid-October . Registration is open until August 12 . The competition covers several fields, including Software and artificial intelligence solutions Cybersecurity Digital games and arts The event is organized by: The Information Technology Industry Development Agency (ITIDA) The Information Technology Institute (ITI) The National Telecommunication Institute (NTI) Egypt University of Informatics (EUI) H.E.Dr. Amr Talaat , Minister of Communications and Information Technology, affirmed that launching the Digitopia competition is part of the ministry’s efforts to support digital creativity and foster a culture of innovation among school and university students and graduates. It provides a platform offering promising opportunities for creative individuals to unleash their ideas, refine their skills, and gain practical experience to transform their concepts into implementable technological solutions that contribute to building a Digital Egypt . He added that digital creativity is a key pillar of the knowledge economy, and the ministry is committed to enhancing the innovation and entrepreneurship ecosystem by expanding the Digital Egypt Creativity Centers (Creativa) across various governorates. These centers offer a range of programs to support digital creativity at all stages. Dr. Talaat also emphasized that the competition targets diverse age groups as part of a comprehensive vision to identify talent at an early stage, alongside broader efforts to nurture and support creative youth. This contributes to preparing a generation capable of innovation and effective participation in the digital transformation journey. The grand prize is EGP 1 million , with total prizes worth EGP 10 million , including both financial and in-kind rewards. Additionally, participants will have access to specialized training opportunities in collaboration with local and international tech companies to help advance their career paths. The competition is divided into four main participant categories : Primary school students (Grades 4–6) Preparatory and secondary school students (Grades 7–12) University students (all majors) Graduates up to the age of 35 The competition proceeds through the following phases : Preliminary phase : Launch of the initiative and opening of registration First phase : Introductory sessions Second phase : Submission of ideas and announcement of qualifiers Third phase : Development of ideas into technological solutions, judging, and announcement of finalists Fourth and final phase : Final round and announcement of winners A jury panel of experts in digital technologies and innovation will evaluate the ideas and projects throughout the competition. Register Here", "length": 491}
{"url": "https://eui.edu.eg/?page=1", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=2", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=3", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=4", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=5", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=6", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=7", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=8", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
{"url": "https://eui.edu.eg/?page=26", "chunk_index": 0, "text": "For the academic year 2025-2026", "length": 5}
