{"url": "https://eui.edu.eg/", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/ar/node/1", "chunk_index": 0, "original": "Skip to main content الصفحة الرئيسية الصورة خطوط الباصات متاحة الان! للعام الأكاديمي 2026-2025 للمزيد الصورة مصروفات العام الأكاديمي 2026-2025 متاحة الان اضغط هنا الصورة قدم الان للفصل الدراسي Fall 2025 سجل الآن الصورة تصنيف تايمز للتعليم العالى التفاصيل الصورة شهادة مزدوجة تمنحك الأفضلية في سوق العمل! سجل الآن الصورة حرم جامعي مجهز علي أعلي مستوي سجل الآن الصورة حرم جامعي ينبض بالحياة! سجل الآن الصورة خريجون منافسون.. يصنعون الفارق في سوق العمل! سجل الآن prev next الكليات كلية الهندسة كلية الهن", "summary": null}
{"url": "https://eui.edu.eg/who-we-are", "chunk_index": 0, "original": "Skip to main content Who we are One of the first specialized universities in Communications and Information Technology Overview At the heart of Knowledge City in the New Administrative Capital, the Ministry of Communications and Information Technology, in collaboration with the Ministry of Higher Education and Scientific Research, established Egypt University of Informatics (EUI) with the goal of becoming a leading institution specialized in the fields of Communications and Information Technolog", "summary": null}
{"url": "https://eui.edu.eg/board-trustees", "chunk_index": 0, "original": "Skip to main content Board of Trustees Image Board of Trustees His Eminence Counsellor Adly Mansour Chairman of the Board of Trustees Counselor Adly Mahmoud Mansour, having previously served as both the President of the Supreme Constitutional Court and the President of the Arab Republic of Egypt, was honored with the prestigious Great Collar of the Nile in recognition of his significant contributions to navigating the transitional phase of Egypt's modern history. Image Eng. Raafat Abdel Aziz Fah", "summary": null}
{"url": "https://eui.edu.eg/top-management", "chunk_index": 0, "original": "Skip to main content Top Management Top Management Prof. Reem Bahgat EUI’s Founding President Prof. Ahmed Mohamed Hamad EUI’s Acting President Prof. Ashraf Mahran Dean Faculty of Engineering Prof. Hoda Mokhtar Dean, Faculty of Computing and Information Sciences Faculty of Computing and Information Sciences Prof. Ashraf Zaki Dean, Faculty of Digital Arts and Design Faculty of Digital Arts and Design Prof. Mohamed Saleh Dean, Faculty of Business Informatics Faculty of Business Informatics", "summary": null}
{"url": "https://eui.edu.eg/eui-founders", "chunk_index": 0, "original": "Skip to main content EUI Founders Image EUI Founders Prof. Reem Bahgat EUI’s Founding President Prof. Mohamed El-Sharkawi Professor of Data Science and Engineering Faculty of Computing and Information Sciences Dr. Amal Elgammal Head of Software Engineering Dept Faculty of Computing and Information Sciences Dr. Amany H.B. Eissa Head of EUI's Entrepreurship and Innovation Center Faculty of Computing and Information Sciences", "summary": null}
{"url": "https://eui.edu.eg/eui-agreements", "chunk_index": 0, "original": "Skip to main content EUI Agreements Purdue West Lafayette Dual bachelor’s degree in Electrical and Computer Engineering with the School of Electrical and Computer Engineering at Purdue West Lafayette University (ranked # 6 in Best Engineering Schools, US. News, 2024) Professional master’s degree in Information Security with Purdue West Lafayette University (ranked # 6 in Cyber Security in US. News, 2024) Read more Official Press Release University of Minnesota Twin Cities Dual bachelor’s degree ", "summary": null}
{"url": "https://eui.edu.eg/times-higher-education-rankings", "chunk_index": 0, "original": "Skip to main content Times Higher Education Rankings Times Higher Education Rankings Ranking for 2025 Egypt University of Informatics (EUI) has maintained its position in the Times Higher Education (THE) Impact Rankings 2025, securing a spot in the 1501+ category despite increased global competition, with participating universities rising from 1,963 in 2024 to 2,318 this year. Sustainable Development Goals: Impact Ranking: 1501+ Good Health and Well-being (ranked 1501+) Quality Education (ranked", "summary": null}
{"url": "https://eui.edu.eg/entry-requirements", "chunk_index": 0, "original": "Skip to main content Entry Requirements At EUI, we guarantee the best high-quality education. Thanaweya Amma & Foreign Certificates Thanaweya Amma Faculty of Engineering Only holders of Maths section are eligible to apply Faculty of Computing & Information Sciences Holders of Maths and Science sections only are eligible to apply Faculty of Digital Arts & Design Holders of all sections are eligible to apply ( Maths, Science & Literature) Faculty of Business Informatics Holders of all sections are", "summary": null}
{"url": "https://eui.edu.eg/required-documents", "chunk_index": 0, "original": "Skip to main content Required documents for different certificates Thanaweya Amma & Foreign Certificates Thanaweya Amma Image Original Thanaweyya Amma Certificate or Certified original (مستخرج رسمى) Original Birth certificate 6 passport-size photos Military Service Form (Namouzag 2 Gond) for Egyptian male students only. Military Service Card (Betaka 6 Gond) or fully stamped Namouzag 7 Gond for Egyptian male applicants born in 2006 and before. *All documents will be examined by the Supreme Counci", "summary": null}
{"url": "https://eui.edu.eg/scholarships", "chunk_index": 0, "original": "Skip to main content Scholarships Image Scholarships Explore a range of scholarships at EUI, including full, merit-based, and athletic ones. Full & Partial Scholarships for Egyptian students EUI is proud to offer full and partial scholarships to Egyptian students for the academic year 2025-2026, helping to make higher education more accessible and affordable. 25 scholarships funded by EUI More Details Prof. Reem Bahgat's  Full Scholarship More Details Partial scholarships for Egyptian students b", "summary": null}
{"url": "https://eui.edu.eg/financial-aid", "chunk_index": 0, "original": "Skip to main content Financial Aid For existing students only Egypt University of Informatics (EUI) offers a financial aid program to existing students who face significant financial challenges, contingent upon the dedicated committee's thorough evaluation of their financial circumstances. To apply, please send an email to [email protected] . You can check the rules and regulations of the financial aid program through this link", "summary": null}
{"url": "https://eui.edu.eg/academic-calendar", "chunk_index": 0, "original": "Skip to main content Academic Calendar Image Academic Calendar Gray background", "summary": null}
{"url": "https://eui.edu.eg/tuition-fees", "chunk_index": 0, "original": "Skip to main content Tuition Fees Image Tuition Fees For 2025-2026 cohort Annual Tuition Fees for Egyptian & Non-Egyptian students (2025-2026) Image Faculty of Engineering Tuition Fees for Egyptian & Non-Egyptian students for 2025-2026 Scholarships based on Academic merit Category C Fees before Academic Scholarships 153510 EGP Category B 135450 EGP Category A 108360 EGP Non-Egyptian 7500 USD Image Faculty of Computing and Information Sciences Tuition Fees for Egyptian & Non-Egyptian students for", "summary": null}
{"url": "https://eui.edu.eg/dorms", "chunk_index": 0, "original": "Skip to main content Dorms Image Dorms Your Home Away from Home Image Dorms Egypt University of Informatics (EUI) provides fully furnished dormitory accommodations for students from outside the Cairo and Giza governorates in Al Rehab City and fully equipped hotel rooms at the Jasmine Inn Hotel in Badr City. Students staying at the dormitories benefit from a range of services, including: Image Internet Connection High-speed internet access is provided to ensure students stay connected. Image Full", "summary": null}
{"url": "https://eui.edu.eg/transportation", "chunk_index": 0, "original": "EUI takes pride in offering convenient bus routes to serve students commuting from Greater Cairo, 6th of October City, and New Cairo. These bus routes are meticulously designed to ensure efficient transportation, catering to the diverse needs of our student body. With regular and reliable service, students can count on timely arrivals and departures, facilitating seamless travel to and from campus. Our bus routes provide a safe and convenient way for students to access the university, fostering ", "summary": null}
{"url": "https://eui.edu.eg/transportation", "chunk_index": 1, "original": "EUI takes pride in offering convenient bus routes to serve students commuting from Greater Cairo, 6th of October City, and New Cairo. These bus routes are meticulously designed to ensure efficient transportation, catering to the diverse needs of our student body. With regular and reliable service, students can count on timely arrivals and departures, facilitating seamless travel to and from campus. Our bus routes provide a safe and convenient way for students to access the university, fostering ", "summary": null}
{"url": "https://eui.edu.eg/conditional-acceptance-fall-2025", "chunk_index": 0, "original": "Skip to main content Conditional Acceptance Fees for Fall 2025 Stay Tuned for the tuition fees for the academic year 2025/2026! Upon receiving Conditional Acceptance, applicants for Fall 2025 are required to pay 30,000 LE, which includes a non-refundable administrative fee of 13,000 LE. If an applicant wishes to withdraw their application, a refund of 17,000 LE (30,000 LE minus the 13,000 LE non-refundable administrative fee) will be granted if the withdrawal request is made WITHIN a week of rec", "summary": null}
{"url": "https://eui.edu.eg/faculty-engineering/home", "chunk_index": 0, "original": "Skip to main content Faculty of Engineering Image Faculty of Engineering Engineer your Future today! About the Faculty The Faculty of Engineering is home to four dynamic academic programs, each focused on the forefront of modern technological engineering. Our exceptional faculty, boasting world-class expertise, is dedicated to pioneering research and delivering cutting-edge education. We're committed to equipping our students with the latest scientific knowledge, shaping them into tomorrow's eng", "summary": null}
{"url": "https://eui.edu.eg/faculty-computing-information-sciences/home", "chunk_index": 0, "original": "Computing and Information Sciences", "summary": null}
{"url": "https://eui.edu.eg/faculty-business-informatics/home", "chunk_index": 0, "original": "Skip to main content Faculty of Business Informatics Image Faculty of Business Informatics About us The Faculty of Business Informatics offers a distinguished Bachelor of Business Administration degree designed at the convergence of business strategy, digital innovation, and data-driven decision-making. With a forward-looking curriculum, the faculty equips students to meet the complex demands of today’s dynamic and technology-intensive global economy. Our programs integrate critical disciplines ", "summary": null}
{"url": "https://eui.edu.eg/faculty-digital-arts-and-design/home", "chunk_index": 0, "original": "Skip to main content Faculty of Digital Arts and Design Image Faculty of Digital Arts and Design Animation Arts & Digital Interior Design programs are now open! Apply now About us At the Faculty of Digital Arts and Design, creativity is at the heart of everything we do. We are a vibrant community of artists, designers, and innovators who are passionate about exploring the endless possibilities at the intersection of technology and art. Our faculty is a space where imagination takes flight—where ", "summary": null}
{"url": "https://eui.edu.eg/EUIlibrary", "chunk_index": 0, "original": "Skip to main content Library EUI's Library EUI's Library offers a range of resources and services to support students’ academic needs: Electronic Books and Publishers: Students have access to top publisher platforms, including Cengage Learning, Macmillan Education, and Cambridge University Press, allowing them to browse and locate textbooks and relevant technologies. Databases and E-Journals: As a member of the Egyptian Knowledge Bank (EKB) Universities, EUI provides access to numerous databases", "summary": null}
{"url": "https://eui.edu.eg/english-department", "chunk_index": 0, "original": "Skip to main content English Department English Department The English language program is designed to fulfill the English language proficiency required for studying at EUI’s different faculties according to the different faculties’ Bylaws, since the language of instruction is English. EUI uses the computer-based Pearson Versant Placement Test to place students according to their placement test score as follows: Students with score 20 – 38 are placed in the First English Foundation Course (HUM00", "summary": null}
{"url": "https://eui.edu.eg/campus-life", "chunk_index": 0, "original": "Skip to main content Campus Life Image Campus Life EUI...Where Every Day is a New Experience EUI's Student Union President: Abdelrahman Khaled Vice-President: Fouad Ahmed Fouad Ali Student Committees: Organization Committee: Zina Khaled Salah (Chair), Seif Mohamed Wafiq (Deputy) Art Committee: Kenzy Tarek Hussein (Chair), Yasmin Mohamed Mahmoud El-Shafei (Deputy) Sports Committee: Murad Emad El-Shorbagy (Chair), Abdullah Yasser Abdelhamid Mahmod Helmy (Deputy) Culture Committee: Sajed Samer Ibra", "summary": null}
{"url": "https://eui.edu.eg/360deg-student-support-framework", "chunk_index": 0, "original": "Skip to main content 360° Student Support Framework Image 360° Student Support Framework EUI: Where Every Student’s Potential Shines. In the vibrant landscape of Egypt's higher education, Egypt University of Informatics (EUI) stands as a beacon of excellence, diversity, and inclusivity. With a diverse student body representing various socio-economic backgrounds and abilities, EUI recognizes the paramount importance of providing comprehensive personalized support to ensure that every student thri", "summary": null}
{"url": "https://eui.edu.eg/food-outlets", "chunk_index": 0, "original": "Skip to main content Food Outlets NOSH Cafeteria NOSH Cafeteria is now open on campus, offering a warm, welcoming space for students, faculty, and staff to unwind and enjoy a variety of snacks, meals, and beverages. With comfortable seating and a friendly atmosphere, NOSH is the perfect spot to relax, grab a quick bite, or catch up with friends. The menu features a range of options, including freshly prepared sandwiches, salads, pastries, fruit cups, smoothies, and a selection of coffee, tea, an", "summary": null}
{"url": "https://eui.edu.eg/wellbeing", "chunk_index": 0, "original": "Skip to main content Wellbeing Image Psychosocial Support With You Towards a Balanced University Life Welcome to the vibrant and dynamic Department of Student Life at Egypt University. We are committed to enriching your university experience through various units designed to cater to different aspects of student life. Explore the diverse opportunities available to you fees background Counseling and Psychological Support At EUI, we understand that academic success is not just about achieving good", "summary": null}
{"url": "https://eui.edu.eg/events", "chunk_index": 0, "original": "Skip to main content Events Image Upcoming Events Sorry, we couldn't find any results.", "summary": null}
{"url": "https://eui.edu.eg/previous-events", "chunk_index": 0, "original": "Skip to main content Previous Events Image Previous Events Aug 22 AI Catalyst V.03 22  August  2025 Address EUI Campus-Knowledge City - New Capital AI Catalyst V.03 is taking place on Friday, August 22, from 10:30 a.m. to 6:00 p.m. at the campus of Egypt University of Informatics (EUI) in the Knowledge City, New Administrative Capital. This event is held in collaboration between EUI’s Entrepreneurship and Innovation Center and DotPy.&nbsp;This year’s edition highlights the transformative role of", "summary": null}
{"url": "https://eui.edu.eg/news", "chunk_index": 0, "original": "Skip to main content News Image News 21  August  2025 Prof. Youssri Hassan Appointed Editor at Frontiers in Applied Mathematics and Statistics 14  August  2025 EOCS 2025: Egypt’s Brightest Minds Compete at EUI 9  August  2025 MAIN Segment 2025 Ignites Innovation at EUI", "summary": null}
{"url": "https://eui.edu.eg/newsletters", "chunk_index": 0, "original": "Skip to main content Newsletters Image Newsletters Image December 2024 12  December  2024 Issue Number 1 Issue#1 Image May 2025 25  May  2025 Issue Number 10 Download PDF Image February 2025 26  February  2025 Issue Number 9 Download PDF Image November 2024 30  November  2024 Issue Number 8 Download PDF Image August 2024 20  August  2024 Issue Number 7 Download PDF Image May 2024 20  May  2024 Issue Number 6 Download PDF Image February 2024 20  February  2024 Issue Number 5 Download PDF Image No", "summary": null}
{"url": "https://eui.edu.eg/media-gallery", "chunk_index": 0, "original": "Skip to main content Media Gallery Image Media Gallery Main Segment 2025 9  August  2025 Images prev next Top Thanaweya Amma Achievers 31  July  2025 Images prev next Ctrl+Z Heritage Exhibition 21  July  2025 Images prev next LAND A JOB OFFER IN JAPAN! – FAST OFFER 21  July  2025 Images prev next BI Graduation Projects Discussions - Digital Marketing & E-commerce 1  July  2025 Images prev next Albums by Year: 2024 2023 2022", "summary": null}
{"url": "https://eui.edu.eg/media-coverage-0", "chunk_index": 0, "original": "Skip to main content Media Coverage Media Coverage Image Issue 1 (December 2024) Issue 2 (January 2025) Issue 3 (February 2025) Issue 4 (March 2025) Issue 5 (April 2025) Issue 6 (May 2025) Issue 7 (June 2025) Issue 8 (July 2025) Issue 9 (August 2025)", "summary": null}
{"url": "https://eui.edu.eg/research", "chunk_index": 0, "original": "Skip to main content Research Image Research Researching Today & Revolutionizing Tomorrow. SML-AutoML: A Smart Meta-Learning Automated Machine Learning Framework Read More An Efficient Petrov–Galerkin Scheme for the Euler–Bernoulli Beam Equation via Second-Kind Chebyshev Polynomials Read More Recursive and Explicit Formulas for Expansion and Connection Coefficients in Series of Classical Orthogonal Polynomial Products Read More Characterizing a Generator Polynomial Matrix for the Dual of a Multi", "summary": null}
{"url": "https://eui.edu.eg/projects", "chunk_index": 0, "original": "Skip to main content Projects Reference site about Lorem Ipsum, giving information on its origins, as well as a random Lipsum generator. Under Construction", "summary": null}
{"url": "https://eui.edu.eg/join-euis-team", "chunk_index": 0, "original": "Skip to main content Join EUI's Team! Image Join EUI's Team! Building a talented and dedicated team of professionals We're committed to building a talented and dedicated team of professionals who share our passion for innovation and excellence. Our goal is to attract and retain the best minds in the field, who will help drive our mission to transform the world through education and technology. At EUI, we believe in transparency and fairness in our hiring process. That's why we post all job openi", "summary": null}
{"url": "https://eui.edu.eg/faqs", "chunk_index": 0, "original": "Skip to main content Frequently Asked Questions What is Egypt University of Informatics (EUI)? Egypt University of Informatics (EUI) stands as one of the pioneering specialized institutions in the Middle East and Africa dedicated to Communications, Information Technology, and their associated domains. Established through collaboration between the Ministry of Communications and Information Technology and the Ministry of Higher Education and Scientific Research, EUI is committed to being a premier", "summary": null}
{"url": "https://eui.edu.eg/contact-us", "chunk_index": 0, "original": "Skip to main content Contact Us We're here to help! Contact us for any inquiries. New Administrative Capital, Knowledge City. [email protected] 15702 Admission Phone1 : 01030080940 Admission Phone2 : 01030090509", "summary": null}
{"url": "https://eui.edu.eg/news/prof-youssri-hassan-appointed-editor-frontiers-applied-mathematics-and-statistics", "chunk_index": 0, "original": "Skip to main content 21st August, 2025 Prof. Youssri Hassan Appointed Editor at Frontiers in Applied Mathematics and Statistics Image Prof. Youssri Hassan, Professor of Mathematics at the Faculty of Engineering, has been selected to serve as Editor for Frontiers in Applied Mathematics and Statistics (Section: Mathematics of Computation and Data Science ). With an Impact Factor of 1.5 and a Scopus CiteScore of 2.8 , the journal is recognized internationally for advancing high-quality research in ", "summary": null}
{"url": "https://eui.edu.eg/news/eocs-2025-egypts-brightest-minds-compete-eui", "chunk_index": 0, "original": "Skip to main content 14th August, 2025 EOCS 2025: Egypt’s Brightest Minds Compete at EUI Image The final round of the EgyptIan Olympiad in Computational Science (EOCS) 2025 took place on 14 August at  Egypt University of Informatics (EUI) in the New Administrative Capital, marking the highlight of the competition. Twelve finalist teams, made up of thirty-five students, advanced to this stage, with the majority being high school students from Egypt’s STEM schools, particularly the STEM High Schoo", "summary": null}
{"url": "https://eui.edu.eg/news/main-segment-2025-ignites-innovation-eui", "chunk_index": 0, "original": "Skip to main content 9th August, 2025 MAIN Segment 2025 Ignites Innovation at EUI Image EUI’s campus transformed into a dynamic hub of innovation, as ASME Cairo University, GDG EUI, and EUI joined forces to bring their flagship multidisciplinary event to life EUI . The day was charged with energy and expertise. Attendees benefited from inspiring panels led by industry visionaries; hands-on workshops exploring Industry 4.0, CFD, BIM, HVAC, and beyond; and a career fair that connected emerging tal", "summary": null}
{"url": "https://eui.edu.eg/news/euis-finbud-team-reaches-top-10-cbe-fintech-got-talent-competition", "chunk_index": 0, "original": "Skip to main content 4th August, 2025 EUI’s FinBud Team Reaches Top 10 in CBE FinTech Got Talent Competition Image FinBud, led by Omar Shafie and supported by teammates Omar Sharaf, Omar Hesham, and Shady Adham from the Faculty of Computing & Information Sciences, has secured a spot among the top 10 finalists in the prestigious CBE FinTech Got Talent Competition . After competing against 30 of Egypt’s top university teams, FinBud impressed the judges with its innovative ideas and technical exper", "summary": null}
{"url": "https://eui.edu.eg/news/three-euians-first-place-regional-wameed-short-film", "chunk_index": 0, "original": "Skip to main content 4th August, 2025 Three EUIans Win First Place in Regional “Wameed” Short Film Competition with Grandmatales Image We are proud to announce that three exceptional students from the Faculty of Digital Arts and Design at Egypt University of Informatics (EUI) have won first place in the prestigious Wameed Short Film Competition for their short film titled “Grandmatales.” The Wameed competition, organized by the IEEE Women in Engineering (WIE) Affinity Group at ISSATM, is a regio", "summary": null}
{"url": "https://eui.edu.eg/news/mcit-launches-digitopia-competition-support-innovation-and-discover-talented-youth", "chunk_index": 0, "original": "Skip to main content 2nd August, 2025 MCIT launches the Digitopia competition to support innovation and discover talented youth. Image The Ministry of Communications and Information Technology (MCIT) has launched the annual \"Digitopia\" competition , aimed at discovering and supporting innovative ideas and outstanding projects that contribute to the development of the ICT sector and promote the use of technology in community development. The competition encourages creativity among children and yo", "summary": null}
{"url": "https://eui.edu.eg/?page=1", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=2", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=3", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=4", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=5", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=6", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=7", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=8", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
{"url": "https://eui.edu.eg/?page=26", "chunk_index": 0, "original": "For the academic year 2025-2026", "summary": null}
